[
    {
        "query": "ăn thịt nào bổ nhất",
        "titles": [
            "Thịt chim bồ câu hay gà bổ hơn?",
            "Ăn nhiều thịt đỏ tăng nguy cơ mắc tiểu đường?",
            "Điều gì sẽ xảy ra nếu bạn chỉ ăn nhiều thịt mà không ăn cá?",
            "Tác dụng của từng loại thịt với sức khỏe",
            "Ăn thịt đỏ có làm u ung thư tiến triển nhanh?",
            "Loại rau 'bổ hơn thịt, rẻ như cho' được mệnh danh là thần dược cho sức khoẻ",
            "Chuyện kinh hoàng của người đàn bà có 100 người thân bị ‘ác thú’ hành quyết man rợ",
            "Điều gì sẽ xảy ra nếu bạn thường xuyên ăn thịt gà?",
            "Đậu phụ bổ ngang thịt gà nhưng 'đại kỵ' với 5 nhóm người này",
            "Loại quả rẻ tiền, đắng ngắt nhưng lại là 'thần dược' bổ gan, tránh ung thư",
            "Ăn nhanh hay ăn chậm tốt hơn?",
            "7 loại hạt bổ thận, tốt cho sức khoẻ nên ăn thường xuyên",
            "4 loại thịt nên ngừng hoặc hạn chế ăn nếu không muốn rước bệnh ung thư vào người",
            "Nhật sẽ bổ quả dưa được 'giải cứu' từ dải phân cách",
            "3 lý do vì sao nấm được ví 'bổ ngang thịt'",
            "Phần thịt lợn, thịt bò nào tốt nhất cho sức khỏe?",
            "Ăn thịt gà hâm lại dễ bị ung thư?",
            "Nhật bổ quả dưa hấu được 'giải cứu' từ dải phân cách",
            "Loại thịt này 'đại kỵ' với 4 nhóm người sau",
            "Thịt lươn ngon, bổ dưỡng nhưng lại 'đại kỵ' với 3 nhóm người sau",
            "Thịt gà bảo quản trong tủ lạnh được bao lâu?",
            "5 loại đồ uống bổ thận dễ làm tại nhà",
            "Thực hư ăn nhiều thịt khiến bạn đổ \"mồ hôi thịt\"",
            "Loại rau là kho chứa sắt, rẻ gấp nhiều lần thịt bò, chăm ăn không lo thiếu máu",
            "Bật mí loại rau đắt hơn thịt, bổ ngang nhân sâm"
        ],
        "scores": [
            4,
            2,
            3,
            4,
            2,
            2,
            0,
            2,
            0,
            0,
            0,
            0,
            2,
            0,
            0,
            3,
            2,
            0,
            1,
            1,
            0,
            0,
            2,
            0,
            0
        ],
        "tf-idf": 0.6171090944420985,
        "tf-idf+sbert": 0.9442156358208896,
        "bm25": 0.58971200395708,
        "bm25+phobert": 0.8514437773002509
    },
    {
        "query": "làm thế nào để giảm cân hiệu quả",
        "titles": [
            " Minh Hằng lao vào giảm cân để lấy lại vóc dáng sau hơn 1 tháng sinh con",
            "Loại gia vị quen thuộc giúp tăng hiệu quả giảm cân",
            "Thanh Hóa tiếp tục lắp đặt trạm cân, camera tại mỏ khai thác khoáng sản",
            "5 loại sữa hạt giúp cân nặng của bạn xuống nhanh mà chẳng cần tốn công sức",
            "Học ngay 'chìa khóa' giúp giảm cân của người Nhật chỉ bằng cách uống nước lọc",
            "Huấn luyện viên \"bóc mẽ\" sự thật thực phẩm chức năng giảm cân thần thánh",
            "Chỉ cần ngủ đúng những khung giờ này, giảm 5kg trong một tháng không hề khó",
            "Sao Việt giảm cân sai cách: Phương Mỹ Chi bầm dập, Lan Ngọc nhập viện",
            "Làm nhà ở xã hội cho công nhân thuê là giải pháp hiệu quả",
            "Làm gì để dạ dày không \"nổi loạn\" khi bạn ăn giảm cân?",
            "Ăn khoai lang giúp tăng hay giảm cân?",
            "6 mẹo ăn uống cực dễ áp dụng hàng ngày giúp bạn giảm cân không cần tập thể dục",
            "5 mẹo nhỏ giúp đốt mỡ, giảm cân hiệu quả ngay cả khi chìm vào giấc ngủ",
            "Nguyên tắc giúp giảm cân không cần tập luyện",
            "Uống thuốc giảm cân để dáng đẹp, cô gái 17 tuổi bị rối loạn tâm thần",
            "4 loại trà thay thế cà phê, giúp tỉnh táo mà hạ mỡ máu, ngừa ung thư hiệu quả",
            "Nắm chắc 6 mẹo ăn uống ngủ nghỉ này, việc tiêu mỡ giảm cân dễ như trở bàn tay",
            "Điều gì sẽ xảy ra nếu bạn thường xuyên bỏ bữa tối để giảm cân?",
            "TPHCM: Cứ 2 trẻ có 1 trẻ bị thừa cân, béo phì",
            "Nhập viện sau khi uống thuốc giảm cân, không ngờ nhận kết quả dương tính ma túy",
            "Duy trì được điều này đến sau tuổi 60, chị em thuộc nhóm sống thọ",
            "Món ăn sáng gây tăng cân mất kiểm soát"
        ],
        "scores": [
            3,
            5,
            0,
            5,
            5,
            3,
            5,
            2,
            0,
            3,
            3,
            5,
            5,
            5,
            4,
            0,
            5,
            4,
            0,
            3,
            0,
            3
        ],
        "tf-idf": 0.8325613960449271,
        "tf-idf+sbert": 0.968474159091532,
        "bm25": 0.8459390201595288,
        "bm25+phobert": 0.9591937919179951
    },
    {
        "query": "nhà đất giá rẻ",
        "titles": [
            "Tại sao đi du lịch Thái Lan lại rẻ?",
            "Giá điện ở Nga rẻ bất ngờ",
            "Thực phẩm giá rẻ giúp da căng mịn, trẻ trung",
            "Giá của mẫu sedan hạng C rẻ nhất Việt Nam tiếp tục \"thủng đáy\"",
            "Cấp sổ đỏ nhà đất mua bán qua giấy viết tay: TPHCM sẽ triển khai ra sao?",
            "Dùng 10 tỷ đồng để mua nhà đất hay tiếp tục ở chung cư?",
            "Sắp có MacBook giá rẻ?",
            "Nhà đất quận Hoàn Kiếm có giá từ vài trăm triệu đồng đến hơn một tỷ đồng/m2",
            "Cơn ác mộng của ôtô cỡ nhỏ giá rẻ tại Việt Nam",
            "iPhone giá rẻ sẽ có thiết kế giống iPhone 14",
            "Smartphone giá rẻ sắp được trang bị nhiều tính năng như sản phẩm cao cấp",
            "Đây là hình ảnh cho thấy lý do vì sao AirPods \"nhái\" lại có giá rẻ như vậy",
            "Có nên bán 2 căn hộ giá rẻ để mua nhà đất 3 tỷ đồng?",
            "Người Việt rủ nhau chuyển vùng để mua bộ phần mềm Adobe giá rẻ",
            "Phát hiện mới giúp Trung Quốc sản xuất chất bán dẫn giá rẻ bất ngờ",
            "Việt Nam nằm trong số các quốc gia có giá cước internet rẻ nhất thế giới",
            "Citroen e-C3 - ôtô điện châu Âu giá rẻ đấu xe Trung Quốc",
            "Toyota có thể sẽ ra mắt Land Cruiser phiên bản giá rẻ",
            "Công an TP.HCM bắt giam kẻ làm giả giấy tờ nhà đất lừa đảo 88 tỷ đồng",
            "Giá xăng Việt Nam tăng liên tục nhưng không ngờ vẫn là rẻ ở Đông Nam Á",
            "Định giá bán theo phân hạng chung cư sẽ dễ phát sinh cơ chế 'xin - cho'",
            "Có nên bán căn hộ để thuê nhà đất ?",
            "10 mẫu xe thể thao đang có giá rẻ nhất"
        ],
        "scores": [
            0,
            0,
            0,
            0,
            2,
            3,
            0,
            2,
            0,
            0,
            0,
            0,
            3,
            0,
            0,
            0,
            0,
            0,
            1,
            0,
            2,
            2,
            0
        ],
        "tf-idf": 0.9306600301428823,
        "tf-idf+sbert": 0.8514663605598318,
        "bm25": 0.9536124883715867,
        "bm25+phobert": 0.7328867016580376
    },
    {
        "query": "nên đi du lịch nước nào",
        "titles": [
            "Nên học ngành Quản trị Khách sạn - Nhà hàng trong nước hay đi du học?",
            "Hà Nội thu hút khách cao cấp bằng du lịch golf",
            "Đi du lịch Hàn Quốc cần bao nhiêu tiền?",
            "\"Du lịch cung cấp dịch vụ du khách cần, chứ không chỉ cái chúng ta có\"",
            "Tăng cường công tác quản lý điểm đến du lịch",
            "Với 5 triệu đồng nên đi du lịch ở đâu trong nước?",
            "Nên đi du lịch Trung Quốc khi nào?",
            "Nên mua Mazda2, Hyundai Accent hay Kia Sonet?",
            "Đảm bảo các hoạt động du lịch trong dịp Tết Nguyên đán Quý Mão",
            "Những địa điểm thích hợp đi du lịch một mình",
            "Nên mua Mazda2 2018 hay Attrage Premium 2021?",
            "Những mẹo vặt hay tại khách sạn khi đi du lịch",
            "Du lịch Nha Trang nên đi đâu? ",
            "Đẩy mạnh công tác truyền thông du lịch",
            "Nên đi du lịch Singapore vào tháng mấy?",
            "Ngành du lịch Thanh Hóa tìm lối đi riêng",
            "Bí quyết tránh bị ‘chặt chém’ khi đi du lịch",
            "Đi du lịch Thái Lan mùa nào đẹp?",
            "Kinh nghiệm đi du lịch Singapore tự túc",
            "Thành lập Cục Du lịch quốc gia Việt Nam",
            "Du lịch Lào Cai bứt phá mạnh mẽ",
            "Thúc đẩy hợp tác du lịch Việt Nam - Saudi Arabia",
            "Nên chọn ngành hay chọn trường trước?",
            "Nhiều ưu đãi mua xe, tận hưởng mùa du lịch từ Yamaha Motor Việt Nam",
            "Điểm danh những địa điểm du lịch Ninh Thuận không được bỏ lỡ",
            "Nên đi ngủ lúc mấy giờ để da đẹp?",
            "Nào ai hiểu Tình yêu?",
            "Khách du lịch quốc tế đến Việt Nam tăng liên tiếp",
            "Đi du lịch Thái Lan không được mang những gì?",
            "Quảng bá du lịch Việt Nam tại Campuchia",
            "Những chú ý quan trọng khi đi du lịch Trung Quốc"
        ],
        "scores": [
            1,
            3,
            4,
            2,
            1,
            4,
            4,
            0,
            1,
            3,
            0,
            2,
            3,
            1,
            4,
            1,
            2,
            4,
            3,
            1,
            3,
            2,
            0,
            0,
            3,
            0,
            0,
            2,
            1,
            1,
            3
        ],
        "tf-idf": 0.9149800525133633,
        "tf-idf+sbert": 0.8889271001001626,
        "bm25": 0.8302696686465446,
        "bm25+phobert": 0.940863369573327
    },
    {
        "query": "du học nước nào là tốt",
        "titles": [
            "Sinh viên ưu tú Trung Quốc không còn khao khát du học Mỹ",
            "Nên học ngành Quản trị Khách sạn - Nhà hàng trong nước hay đi du học?",
            "Du học phổ thông được học sinh Việt ưa thích nhất ở New Zealand",
            "Hoa hậu Ý Nhi xin lỗi, rời showbiz lên đường du học Úc sau ồn ào phát ngôn",
            "Những vấn đề trẻ thường gặp khi du học từ phổ thông",
            "Trao tặng 41 suất học bổng du học Mỹ cho học sinh tỉnh Kiên Giang\n\n​",
            "6 kênh tham khảo khi chọn trường du học Mỹ",
            "Nữ sinh điểm SAT thuộc top 1% cao nhất thế giới không chọn du học",
            "Hoa hậu Ý Nhi đăng video khóc, xin lỗi sau ồn ào phát ngôn, xác nhận đi du học ",
            "Bỏ dở hai năm đại học để du học Việt Nam",
            "Học phí với sinh viên quốc tế ở các cường quốc du học",
            "Hoa hậu Ý Nhi đi du học 2 năm, rời showbiz",
            "Du học trường top 50 về cũng chỉ chạy grab, lương tháng 15 triệu đồng?",
            "Những tiêu chí quan trọng khi chọn cơ sở giáo dục cho con du học",
            "Lừa góp vốn làm dịch vụ 'chứng minh tài chính' cho người du học",
            "Học bổng ở các thành phố du học tốt nhất thế giới",
            "Đóng góp của du học cho sự phát triển của các trường đại học trong khu vực ASEAN",
            "Tại sao nhiều bạn trẻ lại lựa chọn du học ngành ngôn ngữ Anh?",
            "Tốt và tiếc",
            "Trong ba tháng ở ẩn, Hoa hậu Ý Nhi làm gì?"
        ],
        "scores": [
            4,
            4,
            5,
            2,
            4,
            2,
            4,
            2,
            1,
            2,
            4,
            1,
            1,
            4,
            2,
            5,
            2,
            3,
            0,
            1
        ],
        "tf-idf": 0.8226909190696869,
        "tf-idf+sbert": 0.7740470335274208,
        "bm25": 0.6922796157698604,
        "bm25+phobert": 0.7635366854040557
    },
    {
        "query": "những loại thực phẩm tốt cho cơ bắp",
        "titles": [
            "Loại thịt bò nào tốt nhất cho sức khỏe?",
            "Những thực phẩm 'đại kỵ' hạt dẻ, cần ghi nhớ để tránh rước bệnh vào thân",
            "Cà phê và 5 thực phẩm tốt nhất giúp tránh xa ung thư sẵn có trong nhà bạn",
            "Kiểm nghiệm giúp đánh giá chất lượng và an toàn thực phẩm",
            "Những người nào không nên ăn gạo lứt?",
            "Những lưu ý khi sử dụng hạt sen",
            "Những người không nên ăn lạc",
            "Đến hẹn lại... lo",
            "Bạn trai cơ bắp của Hoa hậu Hòa bình vừa đăng quang tại Việt Nam",
            "700 doanh nghiệp tham gia triển lãm thực phẩm – đồ uống",
            "Top các thực phẩm nam giới tuổi nào cũng nên ăn",
            "Điều gì xảy ra nếu bạn thường xuyên ăn cá mỗi tuần?",
            "5 loại thực phẩm có hại cho não nhưng nhiều người vẫn hồn nhiên ăn",
            "Đảm bảo an toàn thực phẩm dịp Tết Trung thu năm 2022",
            "6 thực phẩm tự nhiên giúp gan khỏe hơn",
            "Loại thịt, cá giúp xây dựng cơ bắp và giảm mỡ thừa",
            "“Tìm hiểu kiến thức an toàn thực phẩm”",
            "8 loại thực phẩm tuyệt đối không ăn vào buổi tối",
            "Thực phẩm giúp lấy lại vóc dáng",
            "Loại thực phẩm không nên ăn nếu muốn kéo dài tuổi thọ",
            "Bắt nhiều vụ buôn bán thực phẩm không rõ nguồn gốc, xuất xứ",
            "7 loại thực phẩm không nên ăn vào bữa sáng dù thèm đến mấy",
            "Những món ăn sáng giúp phụ nữ vừa khỏe vừa đẹp",
            "Phụ nữ cả nước chung tay đảm bảo an toàn thực phẩm",
            "Đẩy mạnh phát triển hệ thống kinh doanh thực phẩm an toàn",
            "Nâng cao nhận thức về tầm quan trọng của an toàn thực phẩm",
            "5 loại thực phẩm nên tránh ăn vào buổi tối kẻo rước hoạ vào thân"
        ],
        "scores": [
            5,
            2,
            1,
            0,
            1,
            1,
            1,
            1,
            0,
            1,
            2,
            2,
            1,
            0,
            1,
            5,
            2,
            1,
            3,
            1,
            1,
            1,
            3,
            1,
            0,
            0,
            1
        ],
        "tf-idf": 0.8713893367117675,
        "tf-idf+sbert": 0.986381341597845,
        "bm25": 0.961691542039224,
        "bm25+phobert": 0.845267204584517
    },
    {
        "query": "cách chống trầm cảm ",
        "titles": [
            "Những vấn đề trẻ thường gặp khi du học từ phổ thông",
            "Áp lực trong kỳ thi đại học ở Hàn Quốc",
            "Hôn nhân bế tắc, người đàn ông lao vào uống rượu đến trầm cảm nặng",
            "Nhạc sĩ Quốc Bảo: Từng muốn tự tử vì trầm cảm, cho đi hết các bộ sưu tập",
            "Tăng cường công tác phòng, chống tội phạm Việt Nam - Vương quốc Anh",
            "Khánh Ngọc \"Vầng trăng khóc\": Từng suy sụp vì mất giọng, trầm cảm sau sinh",
            "Diệp Lâm Anh mắc bệnh trầm cảm cười, Lưu Hương Giang từng bị bạo lực học đường",
            "Bùi Lan Hương lần đầu hé lộ bị trầm cảm, đang \"cố gắng chiến đấu từng ngày\"",
            "Diệp Lâm Anh khóc nức nở kể về bệnh trầm cảm cười ở show Chị đẹp",
            "Bắc Giang chú trọng chống chuyển giá với doanh nghiệp FDI",
            "MC điển trai Hạo Đình tự tử ở tuổi 35",
            "Cách mở tài khoản không cần đến ngân hàng",
            "Người 'giải mã' bộ não cứu bệnh nhân trầm cảm",
            "Cách chống thấm tường giáp ranh khi có khoảng hở",
            "Lan Phương từng trầm cảm sau sinh: 'Cảm thấy mình vô dụng, dễ bị kích động'",
            "Bị trầm cảm không dám đi khám vì sợ mang tiếng \"làm trò\"",
            "Chạy bộ điều trị bệnh trầm cảm tốt như thế nào?",
            "Bạn gái đạo diễn Nguyễn Quang Dũng tiết lộ bị trầm cảm, nghỉ hát 1 năm",
            "Siu Black: ‘Tôi trầm cảm nặng, 10 ngày không ăn uống, tưởng sẽ không qua khỏi’",
            "Hay làm việc xuyên đêm, người phụ nữ phải đi khám tâm thần",
            "Những thước phim cuối cùng của Sulli trước khi tự tử vì trầm cảm",
            "13% học sinh có xu hướng bị trầm cảm vì COVID-19",
            "Giáo viên 'trầm cảm' với những bài làm sáng tạo của học trò",
            "Cách đơn giản chống đọng nước gương hậu ôtô"
        ],
        "scores": [
            3,
            2,
            2,
            2,
            0,
            2,
            2,
            2,
            2,
            0,
            1,
            0,
            4,
            0,
            2,
            1,
            5,
            1,
            1,
            3,
            1,
            3,
            1,
            0
        ],
        "tf-idf": 0.6139812065443807,
        "tf-idf+sbert": 0.6966483524618443,
        "bm25": 0.6075269760862535,
        "bm25+phobert": 0.6868385261641042
    },
    {
        "query": "Phương pháp thiền để giảm stress",
        "titles": [
            "Ngành điện TP Hồ Chí Minh triển khai phương pháp sữa chữa bảo dưỡng tiên tiến",
            "Đổi mới phong cách lãnh đạo, phương pháp công tác, lề lối làm việc gắn với cải cách hành chính trong Đảng",
            "Mỗi ngày nên đi bộ bao nhiêu bước để bảo vệ sức khỏe tim mạch?",
            "Định giá đất mới nhất thế nào khi sửa Luật Đất đai?",
            "Sẽ tuyên dương các giáo viên có nhiều sáng kiến trong phương pháp giảng dạy trong điều kiện khó khăn",
            "Làm đẹp, trị bệnh bằng phương pháp cấy chỉ ",
            "Các thầy, cô giáo hãy trở thành những hạt nhân xây dựng văn hóa học đường mới",
            "Phương pháp khử mặn nước lập kỷ lục về tốc độ bay hơi",
            "Những trường hợp không nên nâng mũi",
            "Bệnh viện Chợ Rẫy TP Hồ Chí Minh: Thực hiện 2 kỹ thuật cao, chuyên sâu điều trị thành công cho 1 bệnh nhân ung thư hạch",
            "Ngắm chùa Ngọa Vân - thánh địa của thiền phái Trúc Lâm",
            "Việt Nam kỳ vọng sản xuất được thuốc phát minh",
            "Triển lãm chuyên đề về Trịnh Công Sơn \"Cảm hứng từ Thiền và Cà phê\"",
            "Tôn Thất Tùng: Người thầy thuốc làm rạng danh y học Việt Nam",
            "Những lý do khiến học sinh không nói được tiếng Anh",
            "Nhà khí tượng trẻ Việt Nam nhận giải thưởng của WMO\n\n​",
            "Hiểu đúng về nâng ngực đẹp bằng phương pháp nội soi",
            "Đi xông hơi nhiều có tốt?",
            "\"Càng nhiều phương pháp xác định giá đất, càng khó áp dụng\"",
            "Nhấn mí giữ được bao lâu?",
            "Quy định phương pháp định giá đất càng công khai, minh bạch càng tốt",
            "Nhấn mí mắt có phải cắt chỉ?",
            "TP. Hồ Chí Minh: Chuyên gia tâm lý học đường sẽ đến hỗ trợ tại 20 trường",
            "Sau sinh con bao lâu thì được nâng mũi?",
            "Sâu răng ở trẻ gây nhiều tác hại nguy hiểm hơn cha mẹ nghĩ",
            "Hút mỡ bụng có nguy hiểm?",
            "Giữ phương pháp thặng dư trong định giá đất",
            "Chanh có làm giảm mụn trứng cá và sẹo?",
            "Con trai Steve Jobs lập công ty nghiên cứu phương pháp chữa ung thư",
            "Bỏ phương pháp thặng dư trong định giá đất làm chậm triển khai dự án?",
            "Cơ chế, phương pháp nào xác định giá đất theo nguyên tắc thị trường?",
            "Có nên triệt lông bằng laser?",
            "Stress: \"Thủ phạm quen mặt\" ảnh hưởng xấu đến đường tiêu hóa",
            "Những điểm đặc biệt khiến phương pháp giáo dục Kumon trở nên phổ biến",
            "Tại sao hệ tiêu hóa khỏe giúp ngăn ngừa stress?",
            "Những lý do khiến doanh nghiệp bia chưa muốn thay đổi cách tính thuế tiêu thụ đặc biệt",
            "Nguyên tắc giúp giảm cân không cần tập luyện",
            "Phải quy định ngay trong luật phương pháp xác định giá đất",
            "Đổi mới mạnh mẽ về tài chính đất đai",
            "Để quá trình định giá đất toàn vẹn hơn",
            "Đổi mới phương pháp học môn Lịch sử trong nhà trường và cộng đồng",
            "Khởi tố, bắt tạm giam chủ khu đất Tịnh thất Bồng Lai",
            "Stress đến rụng tóc, bỏ lương 2.000 USD về quê tìm cuộc sống cân bằng",
            "Trường phái Đông Dương cách tân trong căn hộ 95 m2",
            "Trau dồi kỹ năng tự học với mỗi “Công dân học tập” thời kỳ 4.0",
            "Ám ảnh bị cô giáo mắng \"không có não\", nữ sinh stress, sụt cả chục cân?",
            "Sinh con được 2 tuần, Khánh Thi livestream khẳng định có lúc suy nghĩ tiêu cực",
            "Nghiên cứu thành công phương pháp trị liệu ung thư buồng trứng bằng virus sởi",
            "Rác và xử lý rác",
            "Giá bia bình dân tăng 85% nếu áp thuế tiêu thụ đặc biệt theo phương pháp hỗn hợp",
            "Tranh luận về đề nghị bỏ phương pháp thặng dư trong định giá đất",
            "Đổi mới phương pháp dạy học và kiểm tra, đánh giá môn Ngữ văn",
            "Phương pháp định giá đất phải công khai, minh bạch để bảo vệ cán bộ",
            "Xu hướng thiết kế \"vườn Nhật mini\" tại gia ở The Zenpark",
            "Đề xuất UNESCO công nhận sự giác ngộ của Đức Phật là di sản văn hóa",
            "Một số phương pháp học ngoại ngữ hiệu quả dành cho bạn",
            "Nghiên cứu kỹ lưỡng khi thay đổi phương pháp tính thuế tiêu thụ đặc biệt với bia rượu"
        ],
        "scores": [
            0,
            0,
            3,
            0,
            0,
            1,
            0,
            0,
            0,
            0,
            2,
            0,
            4,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            2,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            2,
            0,
            2,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            1,
            0,
            0,
            1,
            1,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            2,
            0,
            0
        ],
        "tf-idf": 0.5624506142489066,
        "tf-idf+sbert": 0.6768668389535123,
        "bm25": 0.5961589754318539,
        "bm25+phobert": 0.32279637830098756
    },
    {
        "query": "môn thể thao giúp tăng chiều cao",
        "titles": [
            "Đề xuất thi tốt nghiệp 2025 với 2 môn bắt buộc: Gọn nhẹ, phù hợp với thế giới",
            "SEA Games 31: Địa điểm thi đấu các môn thể thao",
            "4 bài tập giúp tăng chiều cao cho người trưởng thành",
            "Tăng số lượng môn thi đấu Đại hội thể thao toàn quốc lần thứ IX",
            "Tìm hướng đi phù hợp cho thể thao Việt Nam",
            "Đoàn thể thao Việt Nam không thành công ở các môn rowling và Judo",
            "Đại hội Thể thao toàn quốc lần thứ IX sẽ có 40 môn thi đấu",
            "Ủng hộ phương án thi 4 môn với kỳ thi tốt nghiệp THPT của Bộ GDĐT",
            "Tăng cường phát triển kinh tế trong thể thao",
            "SEA Games 31: Đoàn thể thao Việt Nam có những tấm HCV đầu tiên",
            "Hơn 10.000 VĐV tham dự Đại hội Thể thao toàn quốc lần thứ IX",
            "Hàn Quốc tính giảm số môn thi vào đại học",
            "Đoàn Quân đội xếp thứ nhất môn bơi tại Đại hội thể thao toàn quốc lần thứ IX",
            "Hơn 300 vận động viên khối giáo dục nghề nghiệp tranh tài các môn thể thao",
            "Giải mã sức hút của Garmin fēnix 7 Pro với giới thể thao chuyên nghiệp",
            "Việt Nam tham gia đủ 11 nội dung ở Đại hội thể thao người khuyết tật Đông Nam Á lần thứ 11",
            "Hà Nội: Quận Tây Hồ sẵn sàng tổ chức môn Taekwondo tại SEA Games 31",
            "Thể thao Việt Nam tích cực hướng tới những giải đấu lớn",
            "Wushu giành 3 huy chương Vàng cho thể thao Việt Nam",
            "Vĩnh Long hưởng ứng ngày Thể thao Việt Nam",
            "Ban hành lịch thi đấu SEA Games 31",
            "Không giỏi tiếng Anh nên học ngành nào?",
            "Nhóm ngành nghề khối A dễ xin việc, lương cao nhất",
            "Bộ Giáo dục kiến nghị thi tốt nghiệp 2025 với hai môn bắt buộc",
            "Phấn đấu nhiều hơn nữa, quyết tâm cao hơn nữa, nỗ lực lớn hơn để chinh phục những đỉnh cao mới",
            "Đề xuất thi tốt nghiệp THPT 2025 bằng 5 môn ",
            "TP HCM phấn đấu mỗi học sinh chơi thạo một môn thể thao",
            "ASIAD 19: Đoàn thể thao Việt Nam xếp thứ 17",
            "Đại hội Thể thao toàn quốc 2022 tổ chức 43 môn",
            "Bộ Giáo dục tháo gỡ khó khăn trong dạy môn tích hợp",
            "Khối B2 bao gồm những môn nào?",
            "Bóng đá là một trong những cầu nối hiệu quả giữa nhân dân các nước",
            "Môn lặn giành 5 tấm HCV trong ngày thi đấu đầu tiên",
            "Quảng Yên nhất toàn đoàn môn Võ thuật cổ truyền",
            "Karate quốc gia thành công là bệ phóng cho phong trào phát triển",
            "Gìn giữ, phát triển các môn thể thao dân tộc ở Hòa Bình",
            "Sôi nổi các hoạt động thể thao chào mừng 92 năm Ngày truyền thống ngành Tuyên giáo",
            "Nhà Văn hóa lao động An Giang kín khách đăng ký vào giờ tan tầm",
            "Đưa hơn 20 môn thể thao vào chương trình thi đấu SEA Games 31",
            "Giao lưu thể thao chào mừng kỷ niệm 98 năm Ngày Báo chí cách mạng Việt Nam",
            "ASIAD 19: Đoàn thể thao Việt Nam giành huy chương vàng đầu tiên",
            "Công bố các môn thể thao chính thức SEA Games 32",
            "Đại hội Thể thao toàn quốc 2022: Môn Điền kinh lập nhiều kỷ lục",
            "Quý I/2023: Sôi nổi nhiều hoạt động thể thao",
            "Đề thi Tiếng Anh phần lớn các câu hỏi kiến thức, từ vựng rất quen thuộc",
            "Điều chỉnh thời gian tổ chức Đại hội Thể dục, thể thao các cấp",
            "Đoàn Thể thao Việt Nam tiếp tục giành được nhiều huy chương",
            "Ấn tượng thể thao 6 tháng đầu năm",
            "SEA Games 31 sẽ tổ chức 36 môn thi",
            "Xây dựng nền tảng vững chắc, tạo đột phá mới cho Thể thao Việt Nam",
            "Thành lập đoàn Thể thao Việt Nam dự ASIAD-19",
            "Điền kinh mở màn với nhiều kỷ lục tại Đại hội thể thao toàn quốc 2022",
            "ASIAD 19: Võ sĩ dân tộc Thái giành huy chương đồng cho đoàn thể thao Việt Nam",
            "Có nên chạy bộ khi trời lạnh?",
            "Hà Nội tổ chức giải thể thao các môn hè 2020",
            "Triển khai công tác tổ chức môn Wushu SEA Games 31",
            "Thể thao Việt Nam thích ứng với điều kiện bình thường mới",
            "Hòa Bình: Gìn giữ, phát triển các môn thể thao dân tộc",
            "SEA Games 31 sẽ diễn ra từ ngày 12/5 đến ngày 23/5/2022",
            "SEA Games 31: Khởi tranh môn Futsal nữ, Việt Nam thắng đậm Myanmar 6-0",
            "SEA Games 31: Đoàn thể thao Việt Nam tiếp tục có thêm Huy chương Vàng",
            "Cờ tướng - sân chơi trí tuệ giúp người cao tuổi sống vui, sống khỏe",
            "Đại hội Thể thao toàn quốc lần thứ IX: Các môn thi và địa điểm thi đấu",
            "Phát triển hơn nữa thể thao trong khu vực ASEAN",
            "Hưng Yên giảm hai môn thi lớp 10",
            "SEA Games 32 chính thức chốt danh sách 37 môn thi đấu",
            "Chờ thông điệp định hướng cho thể thao Việt Nam",
            "Tiếng Anh quan trọng, nhưng nên là môn lựa chọn của kỳ thi tốt nghiệp THPT",
            "Olympic vẫn là đấu trường khó với thể thao Việt Nam",
            "Đề xuất thi tốt nghiệp THPT chỉ hai môn bắt buộc",
            "Vinh quang Thể thao Việt Nam"
        ],
        "scores": [
            0,
            1,
            4,
            1,
            1,
            1,
            1,
            0,
            1,
            1,
            1,
            0,
            1,
            1,
            0,
            1,
            1,
            1,
            1,
            1,
            1,
            0,
            0,
            0,
            1,
            0,
            1,
            1,
            1,
            0,
            0,
            1,
            1,
            1,
            1,
            1,
            1,
            1,
            1,
            1,
            1,
            1,
            1,
            1,
            0,
            1,
            1,
            0,
            1,
            1,
            1,
            1,
            1,
            1,
            1,
            2,
            1,
            1,
            1,
            1,
            1,
            0,
            1,
            1,
            0,
            1,
            1,
            0,
            1,
            0,
            1
        ],
        "tf-idf": 0.5281022364404759,
        "tf-idf+sbert": 0.9626796385476866,
        "bm25": 0.5725027845097034,
        "bm25+phobert": 0.9558192191175893
    },
    {
        "query": "những nguyên nhân gây tai nạn giao thông",
        "titles": [
            "Tai nạn giao thông nghiêm trọng tại Lào Cai, 4 người thương vong",
            "Những sai lầm khiến xe máy ngốn xăng nhiều hơn",
            "Đề xuất nồng độ cồn là nội dung đầu tiên khi điều tra tai nạn giao thông",
            "Tai nạn giao thông làm 5 người thương vong ở Đồng Nai: Thông tin mới nhất ",
            "Nguyên nhân điều chỉnh tiến độ Sân bay Long Thành chưa thuyết phục",
            "Khắc phục hậu quả vụ tai nạn giao thông đặc biệt nghiêm trọng tại Lạng Sơn",
            "Tai nạn trên quốc lộ 20 ở Đồng Nai khiến 1 người phụ nữ tử vong",
            "Hiểm họa từ thả rông bò đi trên đường gây tai nạn giao thông",
            "Vì sao vẫn còn xảy ra một số vụ tai nạn giao thông đặc biệt nghiêm trọng?",
            "Những nguyên nhân khiến vô lăng ô tô rung lắc",
            "Tạm giữ 2 nhân viên môi trường liên quan vụ xe rác gây tai nạn chết người ",
            "Những ứng dụng gây hao pin nhất trên Android",
            "Khẩn trương điều tra vụ tai nạn thảm khốc làm 15 người thương vong ở Lạng Sơn",
            "Những lỗi phụ nữ thường mắc khi lái ô tô dễ gây tai nạn",
            "Tai nạn 5 người chết ở Lạng Sơn: Khởi tố tài xế xe đầu kéo",
            "Những nguyên nhân khiến gạt nước ô tô kém hiệu quả",
            "Thừa Thiên Huế: Khởi tố tài xế gây tai nạn làm 2 người chết",
            "Những nguyên nhân khiến ô tô 'ngốn' xăng ",
            "Xác minh, điều tra làm rõ vụ tai nạn giao thông làm 2 người chết",
            "\"Bí quyết\" nào giúp các tỉnh kéo giảm tai nạn giao thông?",
            "Hiểm họa từ thả rông bò đi trên đường gây tai nạn giao thông",
            "Tai nạn giao thông giảm sâu cả ba tiêu chí",
            "Phút tưởng niệm đồng bào mất vì tai nạn giao thông tại Việt Nam",
            "Những vị trí ngồi an toàn và nguy hiểm nhất trên ô tô không phải ai cũng biết",
            "Tai nạn giao thông được kéo giảm sâu trong 6 tháng đầu năm",
            "Ngày đầu nghỉ lễ, cả nước xảy ra 32 vụ tai nạn giao thông",
            "Những nguyên nhân khiến ô tô mất lái và cách xử lý an toàn",
            "Bé gái 15 tuổi chạy xe máy bị tai nạn giao thông, biến dạng vùng mặt",
            "3 vụ tai nạn giao thông trên cùng 1 huyện làm 4 người tử vong",
            "Thanh niên Đà Nẵng tưởng niệm các nạn nhân tử vong vì tai nạn giao thông",
            "Bình Dương tập trung đảm bảo an toàn giao thông những tháng cuối năm",
            "Biến đau thương thành hành động cụ thể để đẩy lùi tai nạn giao thông!",
            "Điều tra nguyên nhân vụ tai nạn khiến một phụ nữ tử vong",
            "Xúc động Lễ tưởng niệm nạn nhân tai nạn giao thông năm 2023",
            "8 ngày, xử lý hơn 7.600 trường hợp vi phạm về nồng độ cồn",
            "Những nguyên nhân khiến ô tô dễ bị lật",
            "Tăng cường xóa các \"điểm đen\" giao thông",
            "Những tai nạn nguy hiểm chết người vì thói quen \"dán mắt\" vào điện thoại",
            "76 người tử vong vì tai nạn giao thông trong 4 ngày nghỉ lễ",
            "Từ đầu năm, 131 người thương vong do tai nạn giao thông ở Yên Bái",
            "Sơn La: Đảm bảo an toàn giao thông dịp nghỉ Lễ Quốc khánh",
            "Bắc Ninh tăng cường kiểm tra, xử lý vi phạm trật tự an toàn giao thông",
            "Cán bộ vi phạm nồng độ cồn sẽ gửi thông báo về cơ quan",
            "Duy Mạnh bị tai nạn xe máy, không thể tập trung cùng đội tuyển Việt Nam",
            "Tai nạn giao thông tiếp tục tăng trong ngày nghỉ lễ thứ ba",
            "Hơn 450 triệu đồng đến với cô gái mất 2 chân sau tai nạn giao thông",
            "Những rủi ro cần lường trước khi mua bảo hiểm nhân thọ",
            "TP Hồ Chí Minh tập trung khắc phục, kéo giảm ùn tắc, tai nạn giao thông",
            "Đồng Nai xử lý 9 điểm đen tai nạn giao thông trên các tuyến quốc lộ",
            "Tai nạn giao thông nghiêm trọng: Trách nhiệm thuộc về ai?",
            "20.000 học sinh, sinh viên tham gia tìm hiểu pháp luật về an toàn giao thông",
            "Những luật giao thông kỳ lạ trên thế giới",
            "Thủ tướng chỉ đạo khắc phục hậu quả vụ tai nạn giao thông đặc biệt nghiêm trọng tại Đồng Nai",
            "27 vụ tai nạn giao thông trong ngày đầu nghỉ lễ Quốc khánh",
            "Ca sĩ Đan Trường gặp tai nạn giao thông ở Mỹ",
            "Những nguyên nhân khiến ô tô có mùi xăng",
            "Tổ chức lễ tưởng niệm đồng bào qua đời vì tai nạn giao thông trên toàn quốc",
            "Nguyên nhân ban đầu vụ tai nạn giao thông đặc biệt nghiêm trọng ở Lạng Sơn",
            "Thủ tướng yêu cầu khắc phục hậu quả vụ tai nạn giao thông đặc biệt nghiêm trọng tại Khánh Hòa",
            "Khởi tố tài xế ô tô 16 chỗ gây tai nạn làm 5 người chết ở Lạng Sơn"
        ],
        "scores": [
            3,
            2,
            3,
            2,
            0,
            2,
            2,
            5,
            5,
            4,
            2,
            0,
            1,
            5,
            5,
            1,
            4,
            1,
            2,
            3,
            4,
            2,
            1,
            2,
            1,
            2,
            5,
            1,
            1,
            1,
            1,
            1,
            2,
            1,
            3,
            5,
            1,
            5,
            1,
            1,
            1,
            1,
            3,
            1,
            1,
            1,
            0,
            1,
            1,
            1,
            1,
            1,
            1,
            1,
            1,
            0,
            1,
            1,
            1,
            1
        ],
        "tf-idf": 0.7663694090370449,
        "tf-idf+sbert": 0.8996143123699006,
        "bm25": 0.8987798809379678,
        "bm25+phobert": 0.7840207277760698
    },
    {
        "query": "những loại thực phẩm ngon rẻ và bổ",
        "titles": [
            "Những thực phẩm 'đại kỵ' hạt dẻ, cần ghi nhớ để tránh rước bệnh vào thân",
            "Cà phê và 5 thực phẩm tốt nhất giúp tránh xa ung thư sẵn có trong nhà bạn",
            "5 loại cây nên đặt trong phòng ngủ để có giấc ngủ ngon",
            "Thịt chim bồ câu hay gà bổ hơn?",
            "Khoai lang ngon, bổ nhưng 'đại kỵ' với 3 nhóm người sau",
            "Kiểm nghiệm giúp đánh giá chất lượng và an toàn thực phẩm",
            "Tác dụng chữa bệnh của đuôi bò bạn nên biết",
            "Tại sao đi du lịch Thái Lan lại rẻ?",
            "Chuyện ít biết về loài cá cả chục triệu đồng/kg",
            "Những người nào không nên ăn gạo lứt?",
            "Những thức quà từ cốm mang hương vị đặc trưng của thu Hà Nội",
            "Những lưu ý khi sử dụng hạt sen",
            "Đậu nành ngon, bổ nhưng 'đại kỵ' với 6 nhóm người dưới đây",
            "Những người không nên ăn lạc",
            "Các cách bật tính năng âm thanh trong nền của iPhone giúp bạn ngủ ngon hơn",
            "Rau ngót cực bổ nhưng 'đại kỵ' với 3 nhóm người sau",
            "Ăn lạc thường xuyên có tốt cho mạch máu?",
            "Đến hẹn lại... lo",
            "Thực phẩm giá rẻ giúp da căng mịn, trẻ trung",
            "Loại rau 'bổ hơn thịt, rẻ như cho' được mệnh danh là thần dược cho sức khoẻ",
            "Giá của mẫu sedan hạng C rẻ nhất Việt Nam tiếp tục \"thủng đáy\"",
            "Trứng gà cực bổ nhưng 'đại kỵ' với 4 nhóm người này",
            "700 doanh nghiệp tham gia triển lãm thực phẩm – đồ uống",
            "Những lợi ích sức khỏe ấn tượng của mộc nhĩ",
            "4 thực phẩm màu đen cực tốt cho sức khoẻ",
            "Top các thực phẩm nam giới tuổi nào cũng nên ăn",
            "Tập thể dục vào tối muộn có khiến bạn khó ngủ?",
            "Nước mía ngon nhưng 'đại kỵ' với 5 nhóm người sau",
            "Loại thực phẩm ví là 'hạt trường sinh', được ưa chuộng vì bổ dưỡng lại rẻ",
            "Loại quả rẻ tiền, đắng ngắt nhưng lại là 'thần dược' bổ gan, tránh ung thư",
            "Sắp có MacBook giá rẻ?",
            "10 lần uống bồ công anh không bằng một lần ăn rau này, bổ gan lại ngủ ngon",
            "Rau cải ngon nhưng những người này không nên ăn",
            "Loại nấm đang vào mùa: \"Kho thuốc bổ\", hỗ trợ phòng ung thư",
            "Óc heo rất bổ nhưng lại 'đại kỵ' với 3 nhóm người sau",
            "Đỗ xanh ngon, bổ nhưng lại 'đại kỵ' với 6 nhóm người này",
            "Điều gì xảy ra nếu bạn thường xuyên ăn cá mỗi tuần?",
            "5 loại thực phẩm có hại cho não nhưng nhiều người vẫn hồn nhiên ăn",
            "6 thực phẩm tự nhiên giúp gan khỏe hơn",
            "Bánh mì ngon, rẻ nhưng lại 'đại kỵ' với 3 nhóm người sau",
            "Đảm bảo an toàn thực phẩm dịp Tết Trung thu năm 2022",
            "5 tác hại của bánh mì nếu bạn ăn quá nhiều",
            "Những smartphone dưới 5 triệu đồng đáng mua hiện nay",
            "7 loại hạt bổ thận, tốt cho sức khoẻ nên ăn thường xuyên",
            "“Tìm hiểu kiến thức an toàn thực phẩm”",
            "Lạc cực ngon, bổ nhưng 'đại kỵ' với 5 nhóm người sau",
            "Loại củ chỉ mùa đông mới có, là thần dược cho sức khỏe, giá lại rẻ bèo",
            "Nhật sẽ bổ quả dưa được 'giải cứu' từ dải phân cách",
            "8 loại thực phẩm tuyệt đối không ăn vào buổi tối",
            "Hàu ngon, bổ nhưng 'đại kỵ' với 4 nhóm người này",
            "Bắt nhiều vụ buôn bán thực phẩm không rõ nguồn gốc, xuất xứ",
            "3 lý do vì sao nấm được ví 'bổ ngang thịt'",
            "Những món ăn Hàn Quốc ngon nổi tiếng",
            "7 loại thực phẩm không nên ăn vào bữa sáng dù thèm đến mấy",
            "Những món ăn sáng giúp phụ nữ vừa khỏe vừa đẹp",
            "Phụ nữ cả nước chung tay đảm bảo an toàn thực phẩm",
            "Khoai lang bổ nhưng ăn thế nào để tốt cho sức khoẻ?",
            "\"Cà phê Việt ngon mà không đưa ra nước ngoài là sự lãng phí lớn\"",
            "Đẩy mạnh phát triển hệ thống kinh doanh thực phẩm an toàn",
            "Nhật bổ quả dưa hấu được 'giải cứu' từ dải phân cách",
            "Nâng cao nhận thức về tầm quan trọng của an toàn thực phẩm",
            "Những mẫu xe máy điện giá rẻ, phù hợp với học sinh",
            "Nhai những món này vào buổi sáng và trước khi đi ngủ giúp bổ gan, thận",
            "Thịt lươn ngon, bổ dưỡng nhưng lại 'đại kỵ' với 3 nhóm người sau",
            "5 loại thực phẩm nên tránh ăn vào buổi tối kẻo rước hoạ vào thân",
            "Đặt 3 thứ này ở đầu giường trước khi ngủ giúp giải độc, ngủ ngon đến sáng",
            "5 loại đồ uống bổ thận dễ làm tại nhà",
            "10 mẫu xe thể thao đang có giá rẻ nhất",
            "Loại rau là kho chứa sắt, rẻ gấp nhiều lần thịt bò, chăm ăn không lo thiếu máu",
            "Bật mí loại rau đắt hơn thịt, bổ ngang nhân sâm"
        ],
        "scores": [
            1,
            3,
            0,
            3,
            4,
            2,
            3,
            0,
            1,
            2,
            1,
            3,
            4,
            3,
            0,
            3,
            4,
            0,
            2,
            4,
            0,
            3,
            1,
            3,
            3,
            2,
            0,
            2,
            4,
            4,
            0,
            3,
            3,
            4,
            3,
            3,
            3,
            0,
            3,
            4,
            2,
            4,
            0,
            3,
            1,
            4,
            4,
            1,
            1,
            4,
            1,
            3,
            2,
            2,
            1,
            2,
            3,
            1,
            0,
            0,
            1,
            0,
            3,
            4,
            1,
            0,
            3,
            0,
            5,
            3
        ],
        "tf-idf": 0.816877313546753,
        "tf-idf+sbert": 0.7538277093076436,
        "bm25": 0.8840064946088698,
        "bm25+phobert": 0.7659832026815295
    },
    {
        "query": "trò chơi điện tử có tốt không",
        "titles": [
            "Hợp đồng điện tử - công cụ không thể thiếu của doanh nghiệp chuyển đổi số",
            "Cần nói \"không” với những trò chơi phản cảm",
            "Áp dụng ngay quy định hóa đơn điện tử, loạt cây xăng có thể phải đóng cửa",
            "Phát triển công nghiệp điện tử: Cơ hội và chiến lược nào cho Việt Nam",
            "Bàn về áp thuế tiêu thụ đặc biệt với game online",
            "Honda giới thiệu côn điện tử cho xe máy",
            "Nhật Bản \"bùng nổ\" khai thác rác thải điện tử trong bối cảnh giá vàng tăng mạnh",
            "Độc đáo trò chơi đánh yến của đồng bào Tày vùng Tây Bắc",
            "Giải pháp phát triển nhanh ngành công nghiệp điện tử",
            "Người trẻ Đà Nẵng tìm hiểu lịch sử qua trò chơi, thi ảnh trên mạng xã hội",
            "Hà Nội: Ra quân 88 đội hình tình nguyện triển khai cấp CCCD và đăng ký định danh điện tử",
            "Bình Phước: Hướng dẫn kích hoạt tài khoản định danh điện tử cho người dân",
            "Khách Việt có thể xin visa điện tử vào Nga từ 1.8",
            "Phanh tay điện tử có an toàn hơn phanh tay cơ?",
            "Công an, Sở Tài chính ý kiến khác nhau về casino, Chủ tịch TPHCM ra chỉ đạo",
            "Tiếp tục triển khai hiệu quả việc xuất bản sách điện tử",
            "Không hiểu nổi",
            "Tài khoản định danh điện tử sẽ thay thế thẻ CCCD",
            "Học sinh mang thuốc lá điện tử vào cổ như vòng trang sức",
            "Bộ trưởng Tài chính nói gì về việc bán xăng dầu phải xuất hoá đơn điện tử?",
            "Ca khúc mới \"The Girls\" của Blackpink vẫn chưa hạ nhiệt",
            "Thời đại kiếm tiền từ gameshow và những nghệ sĩ lười",
            "Đảm bảo về dữ liệu trong giao dịch điện tử",
            "Ra mắt và vận hành Trung tâm Đào tạo Điện tử Quốc tế đầu tiên tại Việt Nam",
            "Bộ Y tế muốn cấm thuốc lá điện tử",
            "Không quốc gia nào mua nhiều máy bay hơn Ấn Độ trong năm nay",
            "Đồ chơi trẻ em từ nhà sáng tạo nhí",
            "VNPT chính thức được cấp phép cung cấp dịch vụ chứng thực hợp đồng điện tử tại Việt Nam",
            "Đề xuất áp thuế với thiết bị dùng cho thuốc lá điện tử",
            "Khai mạc Triển lãm điện tử quốc tế - NEPCON Việt Nam 2023",
            "Loạt hoạt động đầy màu sắc trong Ngày hội Vệ sinh học đường",
            "Lày cỏ - Trò chơi dân gian lưu giữ bản sắc văn hoá",
            "Cuộc đối đầu tác chiến điện tử tại Dải Gaza",
            "Người lao động Hòa Bình đón chờ nhà máy vi mạch điện tử 200 triệu USD",
            "Chuyện chưa biết về người phục dựng trò chơi 'tế nhị' nhất Việt Nam",
            "Giải pháp nào cho phát triển công nghiệp điện tử Việt Nam?",
            "Sạn và sự cẩu thả ở loạt gameshow thống trị truyền hình Việt",
            "Ban hành Kế hoạch triển khai thi hành Luật Giao dịch điện tử",
            "Lợi ích vượt trội của hộ chiếu điện tử",
            "Bộ Giáo dục sẽ làm học bạ điện tử liên thông trong toàn quốc",
            "Hà Nội thí điểm triển khai sổ sức khỏe điện tử",
            "Thuốc lá điện tử đội lốt hộp sữa, đồ chơi",
            "Không học được Khoa học Máy tính, nên chuyển ngành nào?",
            "Những rủi ro khi rút 1 tỉ đồng tiền tiết kiệm để đầu tư tiền điện tử",
            "4 việc cần làm trước khi dùng thiết bị điện tử mới",
            "VinBus ra mắt tính năng vé tháng điện tử trên smartphone",
            "Mặt tiền biệt thự lấy cảm hứng từ trò chơi xếp gỗ",
            "Thủ tướng yêu cầu giám sát hóa đơn điện tử tại các cây xăng",
            "Không học giỏi tiếng Anh có nên lựa chọn ngành Ngôn ngữ Anh?",
            "Au 2 PC: Điểm đến giao lưu, kết bạn hấp dẫn dành cho giới trẻ",
            "Sắp phát hành tựa game tái hiện trò chơi trực tuyến kinh điển",
            "Thúc đẩy các hoạt động giao dịch điện tử diễn ra toàn trình bằng phương tiện điện tử",
            "Ngành du lịch Nga hút khách sau khi triển khai thị thực điện tử",
            "Hạ tầng kỹ thuật, công nghệ đã sẵn sàng để mở rộng giao dịch điện tử",
            "Gay cấn trò chơi kéo co giữa Việt Nam - Hàn Quốc",
            "Siết chặt quản lý chống gian lận trong phát hành và sử dụng hóa đơn điện tử",
            "Vì sao FIFA Online 4 đổi tên thành FC Online?",
            "Không tìm được đối tác, Apple có thể hoãn làm xe điện iCar",
            "5 thói quen dễ gây hỏng thiết bị điện tử",
            "Gần 100% văn bản điện tử ký số ngành Tài nguyên môi trường",
            "Tăng cường phối hợp Cổng Thông tin điện tử ĐCSVN và Trang tin Đảng bộ TP Hồ Chí Minh",
            "Phát triển thị trường xuất bản điện tử ở Việt Nam",
            "Chàng trai vàng Olympic Tin học biết lập trình từ lớp 6",
            "Còn nhiều lỗ hổng trong quản lý thuốc lá điện tử",
            "Ai quản lý thuốc lá điện tử?",
            "Cấp thị thực điện tử cho công dân tất cả các nước, vùng lãnh thổ từ ngày 15/8/2023",
            "Bộ trưởng Công Thương: Dự định quản lý thuốc lá điện tử theo hướng cấm"
        ],
        "scores": [
            0,
            1,
            0,
            1,
            3,
            0,
            0,
            1,
            0,
            3,
            0,
            0,
            0,
            0,
            3,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            1,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            1,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            3,
            3,
            0,
            0,
            0,
            0,
            0,
            2,
            0,
            0,
            0,
            0,
            0,
            4,
            0,
            0,
            0,
            0
        ],
        "tf-idf": 0.3858731501257957,
        "tf-idf+sbert": 0.48168141045081003,
        "bm25": 0.4704607352579124,
        "bm25+phobert": 0.42059893412561833
    },
    {
        "query": "cách học hiệu quả",
        "titles": [
            "Cách học từ mới khi nghe tiếng Anh",
            "Cách tẩy trắng lốc xe máy tại nhà",
            "Cách xem YouTube ngoài màn hình siêu đơn giản",
            "Cách tính lãi suất vay ngân hàng theo tháng",
            "Cách xin phép người khác trong tiếng Anh",
            "Cách sử dụng phanh ô tô đúng và an toàn",
            "Quả đào nào có màu sắc khác biệt nhất?",
            "Cách xử lý xe ô tô bị bó phanh",
            "Cách cầm bút tiết lộ bạn có phải người tham vọng?",
            "Quả bóng vàng 2023: Sang Mỹ 'dưỡng già', Messi vẫn làm lu mờ Haaland?",
            "Quả bóng vàng nữ 2023 qua lời kể của các huấn luyện viên",
            "Cách mở số tài khoản đẹp ngân hàng miễn phí",
            "Cách nhận biết các hiệu lệnh của cảnh sát giao thông",
            "Quả bóng rổ có màu khác lạ nhất?",
            "Cách chọn loại dầu nhớt phù hợp nhất cho ô tô ",
            " Cách chặn ứng dụng theo dõi trên iPhone, bạn đã biết chưa?",
            "Cách kiểm tra lượng mưa ngay trên iPhone",
            "Cách tra và những điều cần biết về số khung số máy",
            "Cách tắt quảng cáo trên điện thoại Samsung ít người biết",
            "Cách nhận biết biển báo khu dân cư để không bị phạt",
            "Cách tốt nhất để kích thích lông mày mọc nhanh",
            "Quả và rễ của loại cây mọc dại giúp bảo vệ dạ dày, tăng cường sinh lý nam",
            "Cách sử dụng Messenger mà không cần Facebook",
            "Cách nộp phạt giao thông trên Zalo, bạn đã biết chưa?",
            "Cách tính chính xác khoảng cách an toàn giữa hai xe, tài xế nên biết",
            "Cách phân biệt thiên thạch với đá thường",
            "Cách làm mặt thon gọn trong thời gian ngắn",
            "Quả bom khổng lồ trên núi Chúa: Ly kỳ chuyện xử lý ‘mẹ của các loại bom’",
            "Quả hồng tốt cho tim mạch nhưng cần lưu ý những điều này để tránh bị tắc ruột",
            "Quả đặc sản chín đỏ rực trên thân cây, không cần chăm vẫn \"hưởng lộc\"",
            "Cách nói 'dễ như ăn kẹo' bằng tiếng Anh",
            "Cách tăng độ sáng cho đèn pha ô tô",
            "Cách mở tài khoản không cần đến ngân hàng",
            "Cách lọc tin nhắn rác trên iPhone",
            "Cách chăm sóc da vùng nách",
            "Cách đánh giá an toàn phòng cháy khi thuê, mua căn hộ",
            "Cách tắm trắng bằng lá đinh lăng",
            "Cách xóa dữ liệu cá nhân khỏi ô tô trước khi bán",
            "Cách khai thác tối đa tai nghe AirPods, bạn biết chưa?",
            "Cách nói 'bị cảm', 'sổ mũi' trong tiếng Anh",
            "Cách ẩn hình ảnh trên iPhone không cần ứng dụng",
            "Cách nhận biết biển số ô tô, xe máy của các tỉnh",
            "Cách bật chế độ sạc nhanh trên iPhone",
            "Cách ngồi tiết lộ bạn có tính cách cởi mở hay tự tin",
            "Cách làm trắng da mặt bằng nước gạo",
            "Cách điều trị da cháy nắng tại nhà",
            "Cách giơ tay tiết lộ bạn có phải 'ngoài lạnh trong nóng'",
            "Quả bóng Vàng 2020 bị hủy bỏ do ảnh hưởng của đại dịch COVID-19",
            "Cách mở ứng dụng từ màn hình khóa iPhone",
            "Cách khắc phục những lỗi thẻ ATM thường gặp",
            "Cách chuẩn bị thư giới thiệu khi ứng tuyển đại học Mỹ",
            "Cách nhìn khói bắt bệnh ô tô",
            "Quả núi thiêng chứa đầy báu vật ở Hải Phòng và nỗi kinh sợ của những ‘kẻ cướp mộ’",
            "Cách tẩy lông mặt an toàn",
            "Cách bật bảo mật ứng dụng trên iPhone đơn giản",
            "Cách xóa video đã xem trên YouTube có thể bạn chưa biết",
            "Cách chuyển file từ máy tính sang iPhone không cần app",
            "Quả bom nặng 340kg nằm sát móng nhà dân",
            "Cách rút tiền tại cây ATM không cần thẻ nhanh nhất",
            "Cách đọc tin nhắn Zalo mà không bị phát hiện là 'đã xem'",
            "Đưa VKU thành học hiệu hàng đầu tại miền Trung – Tây Nguyên",
            "Cách xem số điện thoại bạn bè trên Zalo nhanh chóng nhất",
            "Cách xử lý khi không hiểu đối tác nói gì trong tiếng Anh",
            "Cách phát hiện hình ảnh giả do AI tạo ra",
            "Quả cầu ánh sáng xuất hiện trên bầu trời Australia sau tiếng nổ lớn",
            "Cách thoát khỏi thảm cảnh kẹt xe"
        ],
        "scores": [
            4,
            1,
            1,
            1,
            1,
            1,
            0,
            1,
            1,
            0,
            0,
            1,
            1,
            0,
            0,
            1,
            1,
            1,
            1,
            1,
            1,
            0,
            1,
            1,
            1,
            1,
            1,
            0,
            0,
            0,
            2,
            1,
            1,
            1,
            1,
            1,
            1,
            1,
            1,
            1,
            1,
            1,
            1,
            1,
            1,
            1,
            1,
            0,
            1,
            1,
            2,
            1,
            0,
            1,
            1,
            1,
            1,
            0,
            1,
            1,
            1,
            1,
            2,
            1,
            0,
            1
        ],
        "tf-idf": 0.4377758053651123,
        "tf-idf+sbert": 0.707942000345813,
        "bm25": 0.43865407661276695,
        "bm25+phobert": 0.557084049291999
    },
    {
        "query": "Ăn loại rau nào tốt cho sức khỏe nhất",
        "titles": [
            "3 loại rau khoái khẩu của người Việt, nhưng càng ăn nhiều càng dễ bị sỏi thận",
            "Rau thì là và những lợi ích sức khỏe không phải ai cũng biết",
            "Ăn khoai lang hàng ngày có tăng đường huyết?",
            "Điều gì xảy ra với cơ thể nếu bạn ăn húng quế mỗi ngày?",
            "Loại rau dân dã, bán đầy chợ Việt được mệnh danh 'nữ hoàng chống ung thư'",
            "Rau húng chanh có tác dụng gì?",
            "Ăn ngô vào thời điểm nào là tốt nhất?",
            "Ăn nhiều đường không chỉ hại da mà còn nhanh già, đúng hay sai?",
            "Loại rau được thế giới ca ngợi là 'rau trường thọ' mọc đầy ở Việt Nam",
            "Ăn chuối xanh mỗi ngày có tác dụng gì?",
            "Vỏ trái cây và rau củ có tốt cho sức khỏe?",
            "5 thực phẩm 'đại kỵ' với mướp đắng, nếu ăn cùng nhau có thể gây ngộ độc",
            "Ăn khoai lang mỗi ngày có tốt?",
            "Rau ngót cực bổ nhưng 'đại kỵ' với 3 nhóm người sau",
            "Ăn chuối mỗi ngày có tốt cho sức khoẻ?",
            "Loại rau nhiều sắt ngang ngửa thịt bò, được ưu ái gọi là rau 'trường thọ'",
            "Điều gì sẽ xảy ra nếu bạn thường xuyên ăn rau bắp cải?",
            "5 tác dụng tuyệt vời của ngải cứu khô với sức khoẻ",
            "Loại rau 'bổ hơn thịt, rẻ như cho' được mệnh danh là thần dược cho sức khoẻ",
            "Uống nước ép rau củ tươi có sợ ký sinh trùng?",
            "5 công dụng của lá ngải cứu khô giúp loại rau này được coi là 'thần dược'",
            "10 loại rau củ giàu dinh dưỡng nhất, các chuyên gia khuyên nên ăn mỗi tuần",
            "Công dụng của rau bắp cải không phải ai cũng biết",
            "Các làng rau ở Hội An tan hoang sau mưa lớn",
            "Mướp đắng tốt cho sức khoẻ nhưng 'đại kỵ' với 4 nhóm người này",
            "Loại rau bổ ngang nhân sâm, ăn lợi đủ đường, nhưng nhiều người bỏ qua",
            "Loại rau là 'vua rau', axit folic gấp 38 lần táo, ngừa thiếu máu, ăn vào cực bổ",
            "Ăn nửa cân rau này tốt hơn cả 10 củ nhân sâm, nhưng người Việt lại vứt đi",
            "Ăn cơm vào buổi sáng có tốt cho sức khỏe?",
            "Ai không nên ăn mướp đắng?",
            "Rau cải ngon nhưng những người này không nên ăn",
            "4 công dụng vàng thuyết phục bạn nên uống nước rau mùi thường xuyên",
            "7 loại rau quả tốt nên ăn trong mùa đông",
            "5 tác dụng tuyệt vời của hoa thiên lý đối với sức khoẻ",
            "Loại hoa dễ trồng, vừa làm hàng rào lại cực tốt cho sức khoẻ",
            "Ăn cay có tác dụng gì với sức khỏe?",
            "Ăn nhanh hay ăn chậm tốt hơn?",
            "10 lần uống bồ công anh không bằng một lần ăn rau này, bổ gan lại ngủ ngon",
            "Ăn trứng hàng ngày có hại cho cơ thể?",
            "Học sinh thành phố trồng rau gây quỹ học bổng giúp bạn vượt khó",
            "Loại rau được mệnh danh là 'thần dược' của mùa đông",
            "Loại rau đắng, mọc hoang ở các ven sông nhưng lại rất tốt cho sức khoẻ",
            "7 loại hạt bổ thận, tốt cho sức khoẻ nên ăn thường xuyên",
            "Công dụng của rau má với sức khoẻ ít người biết",
            "Uống nước rau mùi có tác dụng gì?",
            "Bắp cải ngon nhưng những người này không nên ăn",
            "Loại rau bổ phổi, mọc dại nhiều nơi ở Việt Nam",
            "Ăn bao nhiêu trứng một ngày là tốt cho sức khỏe?",
            "Ngày Sức khỏe thế giới năm 2023: \"Sức khỏe cho mọi người\"",
            "Ăn ngô thường xuyên có lợi ích gì?",
            "Ăn rau chân vịt có tác dụng gì?",
            "4 loại rau có axit folic cao, ăn thường xuyên rất tốt cho sức khoẻ",
            "Loại rau dại ở Việt Nam lại là 'rau trường sinh', được thế giới săn lùng",
            "Công dụng của tía tô ít người biết",
            "Ăn rau bí có tốt cho sức khỏe?",
            "Rau xà lách rất tốt, chống ung thư nhưng 'đại kỵ' với 6 người này",
            "6 tác dụng tuyệt vời của rau húng quế với sức khoẻ",
            "Những tác hại với sức khỏe khi ăn quá nhiều rau chân vịt, ai cũng nên biết",
            "7 công dụng của rau muống đối với sức khoẻ",
            "Tác dụng của rau ngổ không phải ai cũng biết",
            "Tác dụng của rau sam ít người biết",
            "Rau xanh hâm lại có tốt?",
            "Tác dụng của cây lá lốt ít người biết",
            "Loại rau xưa chỉ người nghèo mới ăn, đem đun nước uống nhận vô vàn lợi ích quý",
            "Rau hẹ cực tốt nhưng lại 'đại kỵ' với 5 nhóm người sau",
            "Những ai không nên ăn bầu?",
            "Rau sống hay rau luộc tốt hơn?"
        ],
        "scores": [
            4,
            4,
            3,
            4,
            4,
            3,
            2,
            0,
            4,
            3,
            3,
            2,
            2,
            4,
            2,
            4,
            4,
            4,
            4,
            3,
            4,
            4,
            3,
            1,
            3,
            4,
            5,
            5,
            0,
            2,
            3,
            3,
            3,
            3,
            3,
            1,
            0,
            4,
            0,
            1,
            4,
            3,
            2,
            3,
            2,
            3,
            3,
            0,
            0,
            2,
            3,
            4,
            5,
            2,
            2,
            3,
            2,
            2,
            3,
            3,
            3,
            1,
            3,
            3,
            3,
            1,
            2
        ],
        "tf-idf": 0.7352514567811242,
        "tf-idf+sbert": 0.7587156871461365,
        "bm25": 0.7298893185517255,
        "bm25+phobert": 0.7215113803022942
    },
    {
        "query": "Những món ăn ngon dành cho người ăn kiêng",
        "titles": [
            "Những món quà ông Kim Jong-un được tặng trong chuyến thăm Nga",
            "Bánh trung thu ngon nhưng 'đại kỵ' với 6 nhóm người này",
            "5 loại cây nên đặt trong phòng ngủ để có giấc ngủ ngon",
            "Cơm nếp ngon nhưng 'đại kỵ' với 5 nhóm người này",
            "Những món vàng kỳ dị và chuyện cả ấp vẫn nghèo dù trúng quả 'cánh đồng vàng'",
            "Loại gia vị quen thuộc giúp tăng hiệu quả giảm cân",
            "Tác dụng chữa bệnh của đuôi bò bạn nên biết",
            "Hoàng hậu phải ăn món gì trước khi động phòng với hoàng đế?",
            "Những thức quà từ cốm mang hương vị đặc trưng của thu Hà Nội",
            "Chuyện ít biết về loài cá cả chục triệu đồng/kg",
            "Măng tươi ngon nhưng lại 'đại kỵ' với 6 nhóm người sau",
            "Ốc luộc ngon nhưng lại 'đại kỵ' với 3 nhóm người này",
            "Các cách bật tính năng âm thanh trong nền của iPhone giúp bạn ngủ ngon hơn",
            "5 món đồ nội thất không cần thiết phải chi nhiều tiền, dễ gây lãng phí",
            "Để sống thọ, không lo bệnh tật, hãy thử 6 nguyên tắc ăn uống sau",
            "Chuyên gia ăn kiêng tiết lộ cách ăn chuối giúp giảm nguy cơ ung thư",
            "Sắn luộc rất ngon nhưng lại 'đại kỵ' với 2 nhóm người sau",
            "Bánh cuốn và bò kho của Việt Nam vào top bữa sáng ngon nhất thế giới",
            "Bánh mì Việt Nam vào danh sách 24 món bánh kẹp ngon nhất thế giới",
            "Những lợi ích sức khỏe ấn tượng của mộc nhĩ",
            "Chấm điểm quán bún cá Hà Nội từng lên kênh truyền hình Mỹ",
            "Khám phá trọn vẹn Phú Yên 4 ngày 3 đêm chỉ với 6 triệu đồng",
            "Tù nhân bị tòa 'trả về nhà' vì béo phì",
            "Tập thể dục vào tối muộn có khiến bạn khó ngủ?",
            "Nước mía ngon nhưng 'đại kỵ' với 5 nhóm người sau",
            "Bọ biển đắt như tôm hùm sống ở đâu?",
            "Óc heo rất bổ nhưng lại 'đại kỵ' với 3 nhóm người sau",
            "Rau cải ngon nhưng những người này không nên ăn",
            "7 món ăn sáng tốt cho sức khoẻ giúp bạn sống lâu, khoẻ mạnh",
            "Báo Australia khen một đặc sản bình dân ở TPHCM “ngon nhất hành tinh”",
            "Huyền thoại Kenny G nói tiếng Việt, hẹn gặp khán giả tại Hà Nội",
            "Độc lạ đặc sản mùa bướm của người dân miền Tây Nghệ An",
            "5 món nội thất bạn nên chi tiền mạnh tay để nâng cao chất lượng cuộc sống",
            "Hé lộ bữa ăn 120 món của hoàng đế và lý do ngài gắp không quá 3 miếng mỗi món",
            "4 công dụng vàng thuyết phục bạn nên uống nước rau mùi thường xuyên",
            "Khai mạc Lễ hội Văn hóa Ẩm thực, Món ngon Saigontourist Group 2023",
            "Xôi ngon nhưng lại 'đại kỵ' với 5 nhóm người sau",
            "Những lần Chi Pu gây ấn tượng với khán giả, nghệ sĩ Trung Quốc khi giới thiệu về ẩm thực, văn hoá Việt",
            "Vì sao cung nữ xưa không dám đụng vào món cá dù rất thích ăn?",
            "Ca sĩ Mỹ Dung giới thiệu đặc sản quê hương Thái Bình",
            "Những cách giúp đôi chân thon thẳng ",
            "Những lý do bạn nhất định phải có một bức tranh trong nhà",
            "Diễn viên Tú Vi và món quà 'độc lạ' ngày 20/10",
            "Những món ăn Hàn Quốc ngon nổi tiếng",
            "Những món ăn sáng giúp phụ nữ vừa khỏe vừa đẹp",
            "Khách Tây khen cơm Huế là bữa ăn ngon để đời",
            "Những loại rau thơm giúp bạn sống khỏe, mọc đầy vườn nhà",
            "Tác dụng ít người biết của hạt mít",
            "Khán giả xúc động bởi cái kết phim \"Món quà của cha\"",
            "\"Cà phê Việt ngon mà không đưa ra nước ngoài là sự lãng phí lớn\"",
            "Món ăn từ dứa giúp dáng đẹp",
            "Giới thiệu món cá thính Lập Thạch trong chương trình “Của ngon vật lạ”",
            "Công dụng tuyệt vời từ quả mướp bạn không nên bỏ qua",
            "Thịt lươn ngon, bổ dưỡng nhưng lại 'đại kỵ' với 3 nhóm người sau",
            "Loại rau có ngay trong vườn nhà, giúp giảm mỡ trong gan tự nhiên",
            "Đặt 3 thứ này ở đầu giường trước khi ngủ giúp giải độc, ngủ ngon đến sáng",
            "Người đàn ông giảm 29kg nhờ ăn \"3 bữa no\" mỗi ngày",
            "Báo Úc khen bò nướng lá lốt của Việt Nam ‘ngon nhất hành tinh’",
            "Công dụng tuyệt vời của cốm xanh không phải ai cũng biết",
            "Vì sao người Nhật coi bí ngô là 'món ăn trường thọ'? "
        ],
        "scores": [
            3,
            3,
            0,
            3,
            0,
            2,
            2,
            2,
            1,
            1,
            3,
            3,
            0,
            0,
            5,
            5,
            3,
            1,
            1,
            2,
            1,
            0,
            0,
            0,
            2,
            0,
            2,
            2,
            3,
            1,
            0,
            0,
            0,
            1,
            3,
            1,
            3,
            1,
            2,
            1,
            2,
            0,
            0,
            1,
            3,
            1,
            2,
            1,
            0,
            1,
            3,
            0,
            3,
            3,
            2,
            0,
            4,
            1,
            2,
            2
        ],
        "tf-idf": 0.47823452224746127,
        "tf-idf+sbert": 0.8001867521159328,
        "bm25": 0.5451197834802948,
        "bm25+phobert": 0.6451529207504568
    }
]