{"scores": [5, 4, 4, 3, 3, 3, 3, 2, 1, 3], "ndcg": 0.9979078905258666, "query": "ăn thịt nào bổ nhất", "titles": ["8 loại thịt giàu protein tốt nhất cho sức khoẻ", "Thịt chim bồ câu hay gà bổ hơn?", "Tác dụng của từng loại thịt với sức khỏe", "Phần thịt lợn, thịt bò nào tốt nhất cho sức khỏe?", "Ăn thịt đỏ có làm u ung thư tiến triển nhanh?", "Điều gì sẽ xảy ra nếu bạn chỉ ăn nhiều thịt mà không ăn cá?", "Loại thịt bò nào tốt nhất cho sức khỏe?", "Bật mí loại rau đắt hơn thịt, bổ ngang nhân sâm", "Loại rau là kho chứa sắt, rẻ gấp nhiều lần thịt bò, chăm ăn không lo thiếu máu", "4 loại thịt nên ngừng hoặc hạn chế ăn nếu không muốn rước bệnh ung thư vào người"]},
{"scores": [5, 5, 5, 5, 4, 4, 0, 0, 4, 4], "ndcg": 0.9912197498134404, "query": "làm thế nào để giảm cân hiệu quả", "titles": ["6 mẹo ăn uống cực dễ áp dụng hàng ngày giúp bạn giảm cân không cần tập thể dục", "Nguyên tắc giúp giảm cân không cần tập luyện", "Nắm chắc 6 mẹo ăn uống ngủ nghỉ này, việc tiêu mỡ giảm cân dễ như trở bàn tay", "5 mẹo tưởng vô lý nhưng có khả năng đốt mỡ cơ thể nhanh chóng nhất", "Thói quen buổi tối giúp đốt cháy mỡ thừa", "Học ngay 'chìa khóa' giúp giảm cân của người Nhật chỉ bằng cách uống nước lọc", "Sao Việt giảm cân sai cách: Phương Mỹ Chi bầm dập, Lan Ngọc nhập viện", "Huấn luyện viên \"bóc mẽ\" sự thật thực phẩm chức năng giảm cân thần thánh", "Chỉ cần ngủ đúng những khung giờ này, giảm 5kg trong một tháng không hề khó", "Nguyên tắc ăn tối không gây béo bụng"]},
{"scores": [5, 4, 3, 3, 3, 2, 5, 2, 0, 0], "ndcg": 0.9093191588929146, "query": "nhà đất giá rẻ", "titles": ["Có nên bán 2 căn hộ giá rẻ để mua nhà đất 3 tỷ đồng?", "Chung cư mini dù nguy hiểm vẫn được chuộng: Xót lòng 2 chữ \"giá nhà\"", "Nhà phố xây trên khu đất 'thóp hậu' giá rẻ", "The CBD - dự án giá rẻ, tiện lợi nhưng còn lo ngại về giao thông", "Bất động sản phát mãi giảm giá hàng chục tỷ đồng vẫn ế", "Giá cổ phiếu bất động sản đắt hay rẻ, có xuống tiền được không?", "Nhà đất quận Hoàn Kiếm có giá từ vài trăm triệu đồng đến hơn một tỷ đồng/m2", "Kinh nghiệm định giá nhà đất từ chuyên gia", "Vì sao chiếc điện thoại giá 12 USD này lại được xem là \"báu vật\" tại Ấn Độ?", "Giá của mẫu sedan hạng C rẻ nhất Việt Nam tiếp tục \"thủng đáy\""]},
{"scores": [2, 4, 1, 2, 2, 1, 4, 2, 1, 1], "ndcg": 0.7261162434704869, "query": "nên đi du lịch nước nào", "titles": ["Những chú ý quan trọng khi đi du lịch Trung Quốc", "Nên đi du lịch Singapore vào tháng mấy?", "Tăng cường công tác quản lý điểm đến du lịch", "Bí quyết tránh bị ‘chặt chém’ khi đi du lịch", "Nên đi du lịch Trung Quốc khi nào?", "Kinh nghiệm du lịch xuyên Việt bằng ô tô", "Với 5 triệu đồng nên đi du lịch ở đâu trong nước?", "Đi du lịch Thái Lan không được mang những gì?", "Khách du lịch quốc tế đến Việt Nam tăng liên tiếp", "Khách du lịch đến Đà Nẵng dịp 30.4 và 1.5 tăng 26%"]},
{"scores": [1, 3, 2, 4, 2, 3, 4, 2, 3, 1], "ndcg": 0.6804005187244317, "query": "du học nước nào là tốt", "titles": ["Nên học ngành Quản trị Khách sạn - Nhà hàng trong nước hay đi du học?", "Tại sao nhiều bạn trẻ lại lựa chọn du học ngành ngôn ngữ Anh?", "Hoa hậu Ý Nhi đi du học 2 năm, rời showbiz", "6 kênh tham khảo khi chọn trường du học Mỹ", "Nữ sinh điểm SAT thuộc top 1% cao nhất thế giới không chọn du học", "Kinh nghiệm chọn ngành du học và định cư Australia", "Du học trường top 50 về cũng chỉ chạy grab, lương tháng 15 triệu đồng?", "Học phí với sinh viên quốc tế ở các cường quốc du học", "Học bổng ở các thành phố du học tốt nhất thế giới", "Nữ sinh trường Y giành học bổng thạc sĩ sau nửa năm chuẩn bị"]},
{"scores": [5, 2, 1, 2, 3, 2, 1, 1, 1, 1], "ndcg": 0.9691463883991794, "query": "những loại thực phẩm tốt cho cơ bắp", "titles": ["Loại thịt, cá giúp xây dựng cơ bắp và giảm mỡ thừa", "Thực phẩm giúp lấy lại vóc dáng", "6 thực phẩm tự nhiên giúp gan khỏe hơn", "6 loại thực phẩm giàu kali tốt cho tim mạch giúp sống thọ", "Loại thịt bò nào tốt nhất cho sức khỏe?", "Top các thực phẩm nam giới tuổi nào cũng nên ăn", "7 loại thực phẩm giàu vitamin A nhất bạn nên ăn thường xuyên", "Những thực phẩm 'đại kỵ' hạt dẻ, cần ghi nhớ để tránh rước bệnh vào thân", "Loại thực phẩm không nên ăn nếu muốn kéo dài tuổi thọ", "Cà phê và 5 thực phẩm tốt nhất giúp tránh xa ung thư sẵn có trong nhà bạn"]},
{"scores": [2, 2, 5, 2, 1, 1, 3, 0, 1, 1], "ndcg": 0.6232630598911801, "query": "cách chống trầm cảm ", "titles": ["Bùi Lan Hương lần đầu hé lộ bị trầm cảm, đang \"cố gắng chiến đấu từng ngày\"", "Bạn gái đạo diễn Nguyễn Quang Dũng tiết lộ bị trầm cảm, nghỉ hát 1 năm", "Chạy bộ điều trị bệnh trầm cảm tốt như thế nào?", "Lan Phương từng trầm cảm sau sinh: 'Cảm thấy mình vô dụng, dễ bị kích động'", "Hôn nhân bế tắc, người đàn ông lao vào uống rượu đến trầm cảm nặng", "Khánh Ngọc \"Vầng trăng khóc\": Từng suy sụp vì mất giọng, trầm cảm sau sinh", "Nhạc sĩ Quốc Bảo: Từng muốn tự tử vì trầm cảm, cho đi hết các bộ sưu tập", "Giáo viên 'trầm cảm' với những bài làm sáng tạo của học trò", "Những thước phim cuối cùng của Sulli trước khi tự tử vì trầm cảm", "Hay làm việc xuyên đêm, người phụ nữ phải đi khám tâm thần"]},
{"scores": [5, 1, 1, 1, 1, 1, 1, 1, 1, 1], "ndcg": 1.0, "query": "môn thể thao giúp tăng chiều cao", "titles": ["4 bài tập giúp tăng chiều cao cho người trưởng thành", "TP HCM phấn đấu mỗi học sinh chơi thạo một môn thể thao", "Đại hội Thể thao toàn quốc 2022 tổ chức 43 môn", "Gìn giữ, phát triển các môn thể thao dân tộc ở Hòa Bình", "Tìm hướng đi phù hợp cho thể thao Việt Nam", "Tăng cường phát triển kinh tế trong thể thao", "Vĩnh Long hưởng ứng ngày Thể thao Việt Nam", "Hòa Bình: Gìn giữ, phát triển các môn thể thao dân tộc", "Quý I/2023: Sôi nổi nhiều hoạt động thể thao", "Chờ thông điệp định hướng cho thể thao Việt Nam"]},
{"scores": [5, 1, 4, 2, 3, 2, 4, 1, 2, 1], "ndcg": 0.9200512069333704, "query": "những nguyên nhân gây tai nạn giao thông", "titles": ["Những nguyên nhân khiến ô tô mất lái và cách xử lý an toàn", "Tai nạn giao thông nghiêm trọng: Trách nhiệm thuộc về ai?", "Nguyên nhân ban đầu vụ tai nạn giao thông đặc biệt nghiêm trọng ở Lạng Sơn", "TP Hồ Chí Minh tập trung khắc phục, kéo giảm ùn tắc, tai nạn giao thông", "Tai nạn 5 người chết ở Lạng Sơn: Khởi tố tài xế xe đầu kéo", "Những nguyên nhân khiến ô tô dễ bị lật", "Vì sao vẫn còn xảy ra một số vụ tai nạn giao thông đặc biệt nghiêm trọng?", "Tai nạn giao thông được kéo giảm sâu trong 6 tháng đầu năm", "Thừa Thiên Huế: Khởi tố tài xế gây tai nạn làm 2 người chết", "Tăng cường xóa các \"điểm đen\" giao thông"]},
{"scores": [2, 0, 3, 1, 4, 1, 4, 0, 0, 2], "ndcg": 0.609426627481793, "query": "những loại thực phẩm ngon rẻ và bổ", "titles": ["Bật mí loại rau đắt hơn thịt, bổ ngang nhân sâm", "5 tác hại của bánh mì nếu bạn ăn quá nhiều", "Thực phẩm giá rẻ giúp da căng mịn, trẻ trung", "5 loại thực phẩm nên tránh ăn vào buổi tối kẻo rước hoạ vào thân", "Loại rau là kho chứa sắt, rẻ gấp nhiều lần thịt bò, chăm ăn không lo thiếu máu", "6 thực phẩm tự nhiên giúp gan khỏe hơn", "Loại rau 'bổ hơn thịt, rẻ như cho' được mệnh danh là thần dược cho sức khoẻ", "Bánh mì ngon, rẻ nhưng lại 'đại kỵ' với 3 nhóm người sau", "7 loại thực phẩm không nên ăn vào bữa sáng dù thèm đến mấy", "7 loại hạt bổ thận, tốt cho sức khoẻ nên ăn thường xuyên"]},
{"scores": [1, 1, 1, 3, 1, 3, 1, 1, 0, 3], "ndcg": 0.6278271666193462, "query": "game có tốt không", "titles": ["Sắp phát hành tựa game tái hiện trò chơi trực tuyến kinh điển", "JX2 Origin - ADNX Mobile: Game Việt trực tuyến kinh điển sắp phát hành", "Hướng dẫn cách cài đặt và chơi game Android trên máy tính chạy Windows", "Ngăn ngừa hành vi phạm tội của đối tượng “nghiện game”", "Giải cứu lao động bị lừa sang Myanmar tạo game ảo moi tiền người Việt", "Ngành công nghiệp game Việt Nam còn nhiều tiềm năng phát triển", "Bàn về áp thuế tiêu thụ đặc biệt với game online", "Nhiều nhân tài về game Việt Nam đang 'ẩn mình'", "Lenovo LOQ 15IRH8: Dòng laptop gaming mới chinh phục mọi đấu trường", "Tử thần có thật từ game ảo"]},
