{"scores": [5, 4, 4, 3, 3, 3, 3, 2, 1, 3], "ndcg": 0.9979078905258666, "query": "ăn thịt nào bổ nhất", "titles": ["8 loại thịt giàu protein tốt nhất cho sức khoẻ", "Thịt chim bồ câu hay gà bổ hơn?", "Tác dụng của từng loại thịt với sức khỏe", "Phần thịt lợn, thịt bò nào tốt nhất cho sức khỏe?", "Ăn thịt đỏ có làm u ung thư tiến triển nhanh?", "Điều gì sẽ xảy ra nếu bạn chỉ ăn nhiều thịt mà không ăn cá?", "Loại thịt bò nào tốt nhất cho sức khỏe?", "Bật mí loại rau đắt hơn thịt, bổ ngang nhân sâm", "Loại rau là kho chứa sắt, rẻ gấp nhiều lần thịt bò, chăm ăn không lo thiếu máu", "4 loại thịt nên ngừng hoặc hạn chế ăn nếu không muốn rước bệnh ung thư vào người"]}
{"scores": [5, 5, 5, 5, 4, 4, 0, 0, 4, 4], "ndcg": 0.9912197498134404, "query": "làm thế nào để giảm cân hiệu quả", "titles": ["6 mẹo ăn uống cực dễ áp dụng hàng ngày giúp bạn giảm cân không cần tập thể dục", "Nguyên tắc giúp giảm cân không cần tập luyện", "Nắm chắc 6 mẹo ăn uống ngủ nghỉ này, việc tiêu mỡ giảm cân dễ như trở bàn tay", "5 mẹo tưởng vô lý nhưng có khả năng đốt mỡ cơ thể nhanh chóng nhất", "Thói quen buổi tối giúp đốt cháy mỡ thừa", "Học ngay 'chìa khóa' giúp giảm cân của người Nhật chỉ bằng cách uống nước lọc", "Sao Việt giảm cân sai cách: Phương Mỹ Chi bầm dập, Lan Ngọc nhập viện", "Huấn luyện viên \"bóc mẽ\" sự thật thực phẩm chức năng giảm cân thần thánh", "Chỉ cần ngủ đúng những khung giờ này, giảm 5kg trong một tháng không hề khó", "Nguyên tắc ăn tối không gây béo bụng"]}
{"scores": [5, 4, 3, 3, 3, 2, 5, 2, 0, 0], "ndcg": 0.9093191588929146, "query": "nhà đất giá rẻ", "titles": ["Có nên bán 2 căn hộ giá rẻ để mua nhà đất 3 tỷ đồng?", "Chung cư mini dù nguy hiểm vẫn được chuộng: Xót lòng 2 chữ \"giá nhà\"", "Nhà phố xây trên khu đất 'thóp hậu' giá rẻ", "The CBD - dự án giá rẻ, tiện lợi nhưng còn lo ngại về giao thông", "Bất động sản phát mãi giảm giá hàng chục tỷ đồng vẫn ế", "Giá cổ phiếu bất động sản đắt hay rẻ, có xuống tiền được không?", "Nhà đất quận Hoàn Kiếm có giá từ vài trăm triệu đồng đến hơn một tỷ đồng/m2", "Kinh nghiệm định giá nhà đất từ chuyên gia", "Vì sao chiếc điện thoại giá 12 USD này lại được xem là \"báu vật\" tại Ấn Độ?", "Giá của mẫu sedan hạng C rẻ nhất Việt Nam tiếp tục \"thủng đáy\""]}
{"scores": [2, 4, 1, 2, 2, 1, 4, 2, 1, 1], "ndcg": 0.7261162434704869, "query": "nên đi du lịch nước nào", "titles": ["Những chú ý quan trọng khi đi du lịch Trung Quốc", "Nên đi du lịch Singapore vào tháng mấy?", "Tăng cường công tác quản lý điểm đến du lịch", "Bí quyết tránh bị ‘chặt chém’ khi đi du lịch", "Nên đi du lịch Trung Quốc khi nào?", "Kinh nghiệm du lịch xuyên Việt bằng ô tô", "Với 5 triệu đồng nên đi du lịch ở đâu trong nước?", "Đi du lịch Thái Lan không được mang những gì?", "Khách du lịch quốc tế đến Việt Nam tăng liên tiếp", "Khách du lịch đến Đà Nẵng dịp 30.4 và 1.5 tăng 26%"]}
{"scores": [1, 3, 2, 4, 2, 3, 4, 2, 3, 1], "ndcg": 0.6804005187244317, "query": "du học nước nào là tốt", "titles": ["Nên học ngành Quản trị Khách sạn - Nhà hàng trong nước hay đi du học?", "Tại sao nhiều bạn trẻ lại lựa chọn du học ngành ngôn ngữ Anh?", "Hoa hậu Ý Nhi đi du học 2 năm, rời showbiz", "6 kênh tham khảo khi chọn trường du học Mỹ", "Nữ sinh điểm SAT thuộc top 1% cao nhất thế giới không chọn du học", "Kinh nghiệm chọn ngành du học và định cư Australia", "Du học trường top 50 về cũng chỉ chạy grab, lương tháng 15 triệu đồng?", "Học phí với sinh viên quốc tế ở các cường quốc du học", "Học bổng ở các thành phố du học tốt nhất thế giới", "Nữ sinh trường Y giành học bổng thạc sĩ sau nửa năm chuẩn bị"]}
{"scores": [5, 2, 1, 2, 3, 2, 1, 1, 1, 1], "ndcg": 0.9691463883991794, "query": "những loại thực phẩm tốt cho cơ bắp", "titles": ["Loại thịt, cá giúp xây dựng cơ bắp và giảm mỡ thừa", "Thực phẩm giúp lấy lại vóc dáng", "6 thực phẩm tự nhiên giúp gan khỏe hơn", "6 loại thực phẩm giàu kali tốt cho tim mạch giúp sống thọ", "Loại thịt bò nào tốt nhất cho sức khỏe?", "Top các thực phẩm nam giới tuổi nào cũng nên ăn", "7 loại thực phẩm giàu vitamin A nhất bạn nên ăn thường xuyên", "Những thực phẩm 'đại kỵ' hạt dẻ, cần ghi nhớ để tránh rước bệnh vào thân", "Loại thực phẩm không nên ăn nếu muốn kéo dài tuổi thọ", "Cà phê và 5 thực phẩm tốt nhất giúp tránh xa ung thư sẵn có trong nhà bạn"]}
{"scores": [2, 2, 5, 2, 1, 1, 3, 0, 1, 1], "ndcg": 0.6232630598911801, "query": "cách chống trầm cảm ", "titles": ["Bùi Lan Hương lần đầu hé lộ bị trầm cảm, đang \"cố gắng chiến đấu từng ngày\"", "Bạn gái đạo diễn Nguyễn Quang Dũng tiết lộ bị trầm cảm, nghỉ hát 1 năm", "Chạy bộ điều trị bệnh trầm cảm tốt như thế nào?", "Lan Phương từng trầm cảm sau sinh: 'Cảm thấy mình vô dụng, dễ bị kích động'", "Hôn nhân bế tắc, người đàn ông lao vào uống rượu đến trầm cảm nặng", "Khánh Ngọc \"Vầng trăng khóc\": Từng suy sụp vì mất giọng, trầm cảm sau sinh", "Nhạc sĩ Quốc Bảo: Từng muốn tự tử vì trầm cảm, cho đi hết các bộ sưu tập", "Giáo viên 'trầm cảm' với những bài làm sáng tạo của học trò", "Những thước phim cuối cùng của Sulli trước khi tự tử vì trầm cảm", "Hay làm việc xuyên đêm, người phụ nữ phải đi khám tâm thần"]}
{"scores": [5, 1, 1, 1, 1, 1, 1, 1, 1, 1], "ndcg": 1.0, "query": "môn thể thao giúp tăng chiều cao", "titles": ["4 bài tập giúp tăng chiều cao cho người trưởng thành", "TP HCM phấn đấu mỗi học sinh chơi thạo một môn thể thao", "Đại hội Thể thao toàn quốc 2022 tổ chức 43 môn", "Gìn giữ, phát triển các môn thể thao dân tộc ở Hòa Bình", "Tìm hướng đi phù hợp cho thể thao Việt Nam", "Tăng cường phát triển kinh tế trong thể thao", "Vĩnh Long hưởng ứng ngày Thể thao Việt Nam", "Hòa Bình: Gìn giữ, phát triển các môn thể thao dân tộc", "Quý I/2023: Sôi nổi nhiều hoạt động thể thao", "Chờ thông điệp định hướng cho thể thao Việt Nam"]}
{"scores": [5, 1, 4, 2, 3, 2, 4, 1, 2, 1], "ndcg": 0.9200512069333704, "query": "những nguyên nhân gây tai nạn giao thông", "titles": ["Những nguyên nhân khiến ô tô mất lái và cách xử lý an toàn", "Tai nạn giao thông nghiêm trọng: Trách nhiệm thuộc về ai?", "Nguyên nhân ban đầu vụ tai nạn giao thông đặc biệt nghiêm trọng ở Lạng Sơn", "TP Hồ Chí Minh tập trung khắc phục, kéo giảm ùn tắc, tai nạn giao thông", "Tai nạn 5 người chết ở Lạng Sơn: Khởi tố tài xế xe đầu kéo", "Những nguyên nhân khiến ô tô dễ bị lật", "Vì sao vẫn còn xảy ra một số vụ tai nạn giao thông đặc biệt nghiêm trọng?", "Tai nạn giao thông được kéo giảm sâu trong 6 tháng đầu năm", "Thừa Thiên Huế: Khởi tố tài xế gây tai nạn làm 2 người chết", "Tăng cường xóa các \"điểm đen\" giao thông"]}
{"scores": [2, 0, 3, 1, 4, 1, 4, 0, 0, 2], "ndcg": 0.609426627481793, "query": "những loại thực phẩm ngon rẻ và bổ", "titles": ["Bật mí loại rau đắt hơn thịt, bổ ngang nhân sâm", "5 tác hại của bánh mì nếu bạn ăn quá nhiều", "Thực phẩm giá rẻ giúp da căng mịn, trẻ trung", "5 loại thực phẩm nên tránh ăn vào buổi tối kẻo rước hoạ vào thân", "Loại rau là kho chứa sắt, rẻ gấp nhiều lần thịt bò, chăm ăn không lo thiếu máu", "6 thực phẩm tự nhiên giúp gan khỏe hơn", "Loại rau 'bổ hơn thịt, rẻ như cho' được mệnh danh là thần dược cho sức khoẻ", "Bánh mì ngon, rẻ nhưng lại 'đại kỵ' với 3 nhóm người sau", "7 loại thực phẩm không nên ăn vào bữa sáng dù thèm đến mấy", "7 loại hạt bổ thận, tốt cho sức khoẻ nên ăn thường xuyên"]}
{"scores": [1, 1, 1, 3, 1, 3, 1, 1, 0, 3], "ndcg": 0.6278271666193462, "query": "game có tốt không", "titles": ["Sắp phát hành tựa game tái hiện trò chơi trực tuyến kinh điển", "JX2 Origin - ADNX Mobile: Game Việt trực tuyến kinh điển sắp phát hành", "Hướng dẫn cách cài đặt và chơi game Android trên máy tính chạy Windows", "Ngăn ngừa hành vi phạm tội của đối tượng “nghiện game”", "Giải cứu lao động bị lừa sang Myanmar tạo game ảo moi tiền người Việt", "Ngành công nghiệp game Việt Nam còn nhiều tiềm năng phát triển", "Bàn về áp thuế tiêu thụ đặc biệt với game online", "Nhiều nhân tài về game Việt Nam đang 'ẩn mình'", "Lenovo LOQ 15IRH8: Dòng laptop gaming mới chinh phục mọi đấu trường", "Tử thần có thật từ game ảo"]}
{"scores": [4, 0, 0, 0, 0, 0, 1, 0, 0, 0], "ndcg": 0.9809610544650982, "query": "cách học hiệu quả", "titles": ["Cách học từ mới khi nghe tiếng Anh", "Quả đào nào có màu sắc khác biệt nhất?", "Cách kiểm tra lượng mưa ngay trên iPhone", "Quả đặc sản chín đỏ rực trên thân cây, không cần chăm vẫn \"hưởng lộc\"", "Cách giơ tay tiết lộ bạn có phải 'ngoài lạnh trong nóng'", "Cách xử lý khi không hiểu đối tác nói gì trong tiếng Anh", "Cách nói 'dễ như ăn kẹo' bằng tiếng Anh", "Quả bóng Vàng 2020 bị hủy bỏ do ảnh hưởng của đại dịch COVID-19", "Quả bóng rổ có màu khác lạ nhất?", "Cách xem YouTube ngoài màn hình siêu đơn giản"]}
{"scores": [4, 4, 4, 3, 3, 2, 4, 4, 2, 4], "ndcg": 0.961426528765518, "query": "Ăn loại rau nào tốt cho sức khỏe nhất", "titles": ["Loại rau xưa chỉ người nghèo mới ăn, đem đun nước uống nhận vô vàn lợi ích quý", "Rau thì là và những lợi ích sức khỏe không phải ai cũng biết", "Loại rau nhiều sắt ngang ngửa thịt bò, được ưu ái gọi là rau 'trường thọ'", "Ăn rau chân vịt có tác dụng gì?", "Ăn rau bí có tốt cho sức khỏe?", "7 loại hạt bổ thận, tốt cho sức khoẻ nên ăn thường xuyên", "Loại rau 'bổ hơn thịt, rẻ như cho' được mệnh danh là thần dược cho sức khoẻ", "Loại rau bổ ngang nhân sâm, ăn lợi đủ đường, nhưng nhiều người bỏ qua", "Những tác hại với sức khỏe khi ăn quá nhiều rau chân vịt, ai cũng nên biết", "Loại rau là 'vua rau', axit folic gấp 38 lần táo, ngừa thiếu máu, ăn vào cực bổ"]}
{"scores": [2, 2, 1, 0, 0, 1, 0, 0, 1, 0], "ndcg": 0.974189378647292, "query": "Cách luyện tập để tăng cơ nhanh chóng", "titles": ["Nâng cao tinh thần thể dục, thể thao cho thanh thiếu niên", "Bài tập giúp cụ bà 78 tuổi, từng mắc ung thư \"cải lão hoàn đồng\"", "Gìn giữ, phát triển các môn thể thao dân tộc ở Hòa Bình", "Cách làm mặt thon gọn trong thời gian ngắn", "NSƯT Tố Nga giảm cân, luyện tập cho chương trình 'Con đường âm nhạc'", "Bài tập thể dục 'quốc dân' của những người sống 100 tuổi ở Nhật Bản", "Thí sinh 19 tuổi ở \"Vietnam Idol 2023\" từng nặng 100kg, tự ti ngoại hình", "Các bộ môn thể thao nỗ lực hướng tới thành tích cao tại SEA Games 31", "Hòa Bình: Gìn giữ, phát triển các môn thể thao dân tộc", "Nhã Phương sinh con thứ 2: Vóc dáng gây bất ngờ, Trường Giang cưng chiều"]}
{"scores": [5, 4, 4, 3, 4, 5, 0, 1, 0, 0], "ndcg": 0.9315203824477813, "query": "Làm sao để tiết kiệm tiền mua nhà", "titles": ["Để tiết kiệm trở thành quốc sách!", "Lý do quan trọng để bạn bắt đầu tiết kiệm ngay từ hôm nay", "Cẩn trọng với các loại thiết bị tiết kiệm điện", "Phát động cuộc thi “Tiết kiệm điện thành thói quen”", "Dùng 10 tỷ đồng để mua nhà đất hay tiếp tục ở chung cư?", "Chuyên gia tài chính tiết lộ công thức vàng để tiết kiệm hiệu quả", "Hơn 270 triệu đồng đến với người đàn ông bị ung thư giai đoạn cuối", "Muốn tăng hiệu quả làm mát lại tiết kiệm điện, bạn hãy dán thứ này lên điều hòa", "Thanh Hóa: Chồng lấy cả tiền sinh hoạt của vợ để mua sắt vụn chế \"siêu xe\"", "Những rủi ro khi rút 1 tỉ đồng tiền tiết kiệm để đầu tư tiền điện tử"]}
{"scores": [1, 0, 3, 0, 4, 0, 1, 1, 5, 1], "ndcg": 0.4524329283709731, "query": "Đi du lịch mùa đông ở đâu đẹp nhất", "titles": ["Kinh nghiệm du lịch biển tiết kiệm", "Dự báo mới nhất về diễn biến thời tiết mùa đông năm nay", "Đi du lịch Thái Lan mùa nào đẹp?", "Tin sáng: Rét đậm, rét hại xuất hiện vào thời điểm nào mùa đông năm nay?", "Carnaval mùa Đông: Thu hút khách đến Quảng Ninh vào mùa du lịch thấp điểm", "9 món đồ giúp nam giới mặc đẹp trong mùa đông", "Tại sao đi du lịch Thái Lan lại rẻ?", "Hưởng trọn vẻ đẹp của thành phố biển với 8 tour Nha Trang trong ngày ", "Báo Đức: Việt Nam thuộc top 10 điểm du lịch mùa Đông đẹp nhất", "Điểm danh những địa điểm du lịch Ninh Thuận không được bỏ lỡ"]}
{"scores": [1, 4, 5, 1, 1, 1, 1, 0, 2, 4], "ndcg": 0.6420178172540829, "query": "Du học tự túc nên chuẩn bị gì", "titles": ["Nên học ngành Quản trị Khách sạn - Nhà hàng trong nước hay đi du học?", "Những tiêu chí quan trọng khi chọn cơ sở giáo dục cho con du học", "Những vấn đề trẻ thường gặp khi du học từ phổ thông", "Tại sao nhiều bạn trẻ lại lựa chọn du học ngành ngôn ngữ Anh?", "Sinh viên ưu tú Trung Quốc không còn khao khát du học Mỹ", "Học viện Quản lý Singapore - nơi du học hàng đầu tại Đông Nam Á", "6 kênh tham khảo khi chọn trường du học Mỹ", "Hoa hậu Ý Nhi đi du học 2 năm, rời showbiz", "Học phí với sinh viên quốc tế ở các cường quốc du học", "Hoa hậu Ý Nhi cập nhật về cuộc sống tại Úc: Tự nấu ăn, tập đi tàu điện"]}
{"scores": [2, 3, 3, 2, 5, 4, 5, 2, 2, 2], "ndcg": 0.6212055609783396, "query": "Những thực phẩm giúp giảm mỡ bụng", "titles": ["Bài tập thể dục giảm mỡ bụng", "Mẹo giảm mỡ bụng cho người lười vận động", "Việc nên làm buổi tối để có vòng eo thon", "Tại sao bạn vẫn phải tập luyện sau khi hút mỡ?", "Nguyên tắc giúp giảm cân không cần tập luyện", "Thực phẩm giúp lấy lại vóc dáng", "5 loại thực phẩm có thể ăn thay cơm trắng, giúp no lâu", "Kiên trì xoa bụng mỗi ngày có tác dụng gì?", "Nằm trên giường cũng có thể giảm mỡ bụng chỉ với 5 bài tập đơn giản", "Mỡ bụng giảm từng ngày chỉ với 5 cách nằm của người Nhật"]}
{"scores": [3, 2, 1, 0, 0, 2, 2, 0, 0, 0], "ndcg": 0.9494468592946514, "query": "Phương pháp thiền để giảm stress", "titles": ["Mỗi ngày nên đi bộ bao nhiêu bước để bảo vệ sức khỏe tim mạch?", "Ngắm chùa Ngọa Vân - thánh địa của thiền phái Trúc Lâm", "Trường phái Đông Dương cách tân trong căn hộ 95 m2", "Khởi tố, bắt tạm giam chủ khu đất Tịnh thất Bồng Lai", "Phương pháp khử mặn nước lập kỷ lục về tốc độ bay hơi", "Tại sao hệ tiêu hóa khỏe giúp ngăn ngừa stress?", "Xu hướng thiết kế \"vườn Nhật mini\" tại gia ở The Zenpark", "Trau dồi kỹ năng tự học với mỗi “Công dân học tập” thời kỳ 4.0", "Những lý do khiến học sinh không nói được tiếng Anh", "Triển lãm chuyên đề về Trịnh Công Sơn \"Cảm hứng từ Thiền và Cà phê\""]}
{"scores": [5, 2, 2, 3, 1, 1, 1, 0, 1, 0], "ndcg": 0.9794080932940822, "query": "Bài tập thể hình nào giúp tăng sức bền", "titles": ["Lợi ích khi nâng tạ nhẹ", "4 bài tập giúp tăng chiều cao cho người trưởng thành", "Lan tỏa những lợi ích tích cực từ Hội thi Sáng tạo video clip bài tập thể dục giữa giờ", "10 bài tập giúp cải thiện sinh lý đơn giản, hiệu quả", "Nằm trên giường cũng có thể giảm mỡ bụng chỉ với 5 bài tập đơn giản", "Bài tập giúp cụ bà 78 tuổi, từng mắc ung thư \"cải lão hoàn đồng\"", "Bài tập thể dục giảm mỡ bụng", "Phối hợp tập luyện trên máy thực tế ảo, 83% bệnh nhân đột quỵ não cải thiện", "Phạm Văn Mách và chuyện các tuyển thủ U50 đoạt thành tích quốc tế", "Thí sinh Siêu mẫu Thể hình Việt Nam đu dây cáp, leo núi"]}
{"scores": [3, 5, 5, 5, 1, 1, 3, 2, 2, 3], "ndcg": 0.8118465806441711, "query": "Nguyên nhân gây ô nhiễm môi trường", "titles": ["Thúc đẩy các giải pháp bảo vệ môi trường trong trường học", "Khởi tố vụ án xả trái phép hàng trăm tấn chất thải công nghiệp", "Khiếu nại, tố cáo liên quan lĩnh vực môi trường tiếp tục tăng", "Ô nhiễm không khí là “sát thủ vô hình” gây thiệt hại lớn về kinh tế và sức khỏe", "Chuyển đổi số với ứng dụng công nghệ thực tế ảo trong giáo dục môi trường", "Tổng kết Chương trình Vì môi trường xanh quốc gia 2023", "Nỗ lực hơn nữa để giải quyết vấn đề cấp bách về ô nhiễm môi trường biển", "Thái Lan: Thành phố Chiang Mai đối mặt vấn đề ô nhiễm không khí nghiêm trọng", "Liên hợp quốc cảnh báo tình trạng ô nhiễm môi trường", "Thông điệp hình ảnh về kinh tế tuần hoàn, giảm thiểu ô nhiễm môi trường"]}
{"scores": [1, 2, 2, 2, 2, 2, 2, 2, 2, 4], "ndcg": 0.6027113773865087, "query": "Những món ăn ngon dành cho người ăn kiêng", "titles": ["Khách Tây khen cơm Huế là bữa ăn ngon để đời", "Bánh trung thu ngon nhưng 'đại kỵ' với 6 nhóm người này", "Hé lộ bữa ăn 120 món của hoàng đế và lý do ngài gắp không quá 3 miếng mỗi món", "Bánh cuốn và bò kho của Việt Nam vào top bữa sáng ngon nhất thế giới", "Báo Australia khen một đặc sản bình dân ở TPHCM “ngon nhất hành tinh”", "Những món ăn Hàn Quốc ngon nổi tiếng", "Thịt lươn ngon, bổ dưỡng nhưng lại 'đại kỵ' với 3 nhóm người sau", "Cơm nếp ngon nhưng 'đại kỵ' với 5 nhóm người này", "Báo Úc khen bò nướng lá lốt của Việt Nam ‘ngon nhất hành tinh’", "7 món ăn sáng tốt cho sức khoẻ giúp bạn sống lâu, khoẻ mạnh"]}
{"scores": [1, 3, 1, 0, 1, 3, 3, 1, 0, 0], "ndcg": 0.6969010948822154, "query": "Chơi game có ảnh hưởng đến trí tuệ không", "titles": ["Giải cứu lao động bị lừa sang Myanmar tạo game ảo moi tiền người Việt", "Ngăn ngừa hành vi phạm tội của đối tượng “nghiện game”", "Sắp phát hành tựa game tái hiện trò chơi trực tuyến kinh điển", "Bàn về áp thuế tiêu thụ đặc biệt với game online", "JX2 Origin - ADNX Mobile: Game Việt trực tuyến kinh điển sắp phát hành", "Nghiện game, tiến sĩ lương nghìn USD mất trắng sự nghiệp, nhập viện tâm thần", "Tử thần có thật từ game ảo", "Ngành công nghiệp game Việt Nam còn nhiều tiềm năng phát triển", "Lenovo LOQ 15IRH8: Dòng laptop gaming mới chinh phục mọi đấu trường", "Hướng dẫn cách cài đặt và chơi game Android trên máy tính chạy Windows"]}
{"scores": [1, 3, 2, 4, 1, 1, 0, 0, 0, 2], "ndcg": 0.6436313228146653, "query": "Làm sao để tập trung khi học bài", "titles": ["Hướng dẫn rèn luyện kỹ năng học ngoại ngữ cho người bắt đầu", "Cách học từ mới khi nghe tiếng Anh", "Trau dồi kỹ năng tự học với mỗi “Công dân học tập” thời kỳ 4.0", "​Áp dụng nhiều giải pháp để học sinh được học tập thuận lợi nhất có thể", "Xây dựng nền tảng, kho học liệu số quốc gia cho tất cả các cấp học", "Ngoài tiếng Anh thì nên chọn học ngôn ngữ nào?", "Bài 3: Những lớp học lúc 0 giờ", "'Lớp 39/40 em đến nhà cô học thêm, con tôi như người dị biệt'", "Bảo đảm biên chế cho ngành giáo dục, đáp ứng yêu cầu dạy - học", "Học trực tuyến: Làm sao để đạt hiệu quả?"]}
{"scores": [2, 3, 4, 2, 4, 2, 2, 0, 3, 0], "ndcg": 0.7449214961423041, "query": "Cách duy trì thói quen lành mạnh", "titles": ["5 thói quen dễ gây hỏng thiết bị điện tử", "Bỏ thói quen cũ trong điều kiện… “bình thường mới”", "8 thói quen bất di bất dịch của cụ ông 95 tuổi người Nhật để sống thọ", "Điều không nên làm khi đánh răng", "Thói quen giúp điện thoại Android chạy mượt", "Những thói quen lái xe khiến tài xế bị phạt nặng", "Những thói quen xấu đang làm hỏng smartphone", "Tập trung chăm lo Tết cho người dân, đảm bảo vui tươi, lành mạnh", "Những thói quen đẹp, đáng học hỏi của giới tài xế Nhật Bản ", "Tạo dựng một không gian thông tin lành mạnh và đáng tin cậy cho người dân"]}
{"scores": [4, 3, 2, 1, 1, 1, 3, 1, 1, 1], "ndcg": 0.9671119904950558, "query": "Những cuốn sách nên đọc để phát triển bản thân", "titles": ["Phát động cuộc thi viết “Trang sách thay đổi đời tôi” năm 2023", "Lan tỏa văn hóa đọc trong thanh niên", "Ra mắt nhiều sách mới nhân Ngày Sách và Văn hóa đọc Việt Nam", "Khai mạc Ngày Sách và Văn hóa đọc Việt Nam tại Thư viện Quốc gia", "Chuỗi hoạt động hấp dẫn hưởng ứng Ngày sách và Văn hóa đọc tại Đường sách TP Cao Lãnh", "Khẳng định tầm quan trọng của sách trong việc bảo tồn và phát huy các giá  trị văn hóa dân tộc", "\"Thú chơi sách\" - Cuốn sách kinh điển về nghệ thuật chơi sách", "Khai mạc chuỗi sự kiện “Sách cho bạn, cho tôi” tại Phố sách Hà Nội", "Để mỗi thanh niên sẽ lựa chọn những cuốn sách làm bạn đồng hành", "“Góc đọc cuối tuần” dành cho thiếu nhi"]}
{"scores": [5, 5, 4, 4, 3, 4, 4, 4, 5, 3], "ndcg": 0.9603178358695063, "query": "Các mẹo giúp tiết kiệm chi phí hàng ngày", "titles": ["Chuyên gia tài chính tiết lộ công thức vàng để tiết kiệm hiệu quả", "Để tiết kiệm trở thành quốc sách!", "Mẹo lái xe điện tiết kiệm pin hơn", "Lý do quan trọng để bạn bắt đầu tiết kiệm ngay từ hôm nay", "Cẩn trọng với các loại thiết bị tiết kiệm điện", "Làm thế nào tiết kiệm chi phí bảo dưỡng ô tô?", "Dầu nhớt có giúp tiết kiệm nhiên liệu?", "Mẹo đổ xăng ô tô vừa tiết kiệm vừa không hại xe", "AI giúp giảm chi phí, tăng trải nghiệm dịch vụ tài chính", "VF 6 gây 'sốt' với chính sách miễn phí 1 năm sạc pin"]}
{"scores": [4, 3, 5, 2, 4, 4, 3, 1, 3, 3], "ndcg": 0.8282514578655956, "query": "Nên đầu tư vào lĩnh vực nào hiện nay", "titles": ["Tháng 5/2023, vốn đầu tư mới tăng mạnh", "Nghịch lý đầu tư công!", "Cần xác định rõ những ngành, lĩnh vực ưu tiên đầu tư của doanh nghiệp nhà nước trong giai đoạn tới", "Giải pháp giúp các tỉnh Đông Nam Bộ đẩy mạnh thu hút đầu tư nước ngoài", "Bất động sản công nghiệp phía Bắc thu hút dự án giá trị cao", "\"Xúc tiến đầu tư Hải Phòng - Nhật Bản năm 2023\"", "Tạo bước đột phá thu hút đầu tư trong lĩnh vực Dầu khí", "Thúc đẩy hợp tác đầu tư bền vững giữa các nước thuộc OECD và Đông Nam Á.", "Bình Định mời gọi đầu tư nhiều lĩnh vực, có dự án 14 tỷ USD", "150 doanh nghiệp Ấn Độ đến tìm hiểu cơ hội đầu tư tại Đồng Tháp"]}
{"scores": [2, 3, 5, 3, 1, 1, 1, 1, 4, 2], "ndcg": 0.6483221101907862, "query": "Những bài tập yoga cơ bản cho người mới bắt đầu", "titles": ["Tập yoga quay Tiktok ‘câu view’, cả thầy và trò phải vào viện", "Nằm trên giường cũng có thể giảm mỡ bụng chỉ với 5 bài tập đơn giản", "Đông đảo yogi tham gia cuộc thi \"21 ngày làm mới thân - tâm - trí cùng yoga\"", "Đồng Tháp: 500 người đồng diễn tại Ngày Quốc tế Yoga lần thứ 9", "Ngày Quốc tế Yoga lần thứ 8 - \"Yoga vì nhân loại\"", "TP Hồ Chí Minh: Ngày Quốc tế Yoga 2022 thu hút gần 1.000 người tham gia", "4 bài tập giúp tăng chiều cao cho người trưởng thành", "10 bài tập giúp cải thiện sinh lý đơn giản, hiệu quả", "Thể lệ cuộc thi \"21 ngày làm mới thân - tâm - trí cùng yoga\"", "“Festival Yoga Mùa xuân – tranh cúp ngôi sao Yoga sống khỏe 2023”"]}
{"scores": [5, 5, 2, 3, 2, 3, 3, 3, 1, 0], "ndcg": 0.9852420501043371, "query": "Tác hại của việc thức khuya thường xuyên", "titles": ["Điều gì xảy ra nếu bạn thường xuyên thức khuya?", "Điều gì xảy ra nếu thường xuyên ăn tối quá muộn?", "Tác hại của việc nằm ngay sau khi ăn", "'Xưa không có bài tập về nhà tôi vẫn giỏi, nay con học ngày học đêm vẫn lo kém'", "Sáng tinh sương", "Những tác hại của việc để điện thoại bên cạnh khi ngủ", "Tác hại của việc \"cắm mặt\" vào điện thoại", "Điều gì xảy ra với cơ thể nếu bạn thường xuyên nhịn ăn sáng?", "Robot Ấn Độ trên Mặt Trăng có thể thức dậy ngày mai", "Điều gì sẽ xảy ra nếu bạn thường xuyên uống nước mật ong trước khi ngủ?"]}
{"scores": [4, 3, 3, 2, 0, 0, 0, 1, 1, 1], "ndcg": 0.9932436585633754, "query": "Cách nấu ăn vừa ngon vừa nhanh", "titles": ["8 mẹo nấu ăn giúp bạn sống tới 100 tuổi", "Loại rau có ngay trong vườn nhà, giúp giảm mỡ trong gan tự nhiên", "Những món ăn Hàn Quốc ngon nổi tiếng", "Báo Australia khen một đặc sản bình dân ở TPHCM “ngon nhất hành tinh”", "Khi cơ quan vũ trụ NASA cũng đi... nấu ăn", "Chuyện ăn uống trong quân đội Trung Quốc thời hiện đại", "Khánh Huyền của \"Người thổi tù và hàng tổng\": Mẹ chồng chiều, thích vào bếp", "Báo Úc khen bò nướng lá lốt của Việt Nam ‘ngon nhất hành tinh’", "Bánh cuốn và bò kho của Việt Nam vào top bữa sáng ngon nhất thế giới", "Bánh trung thu ngon nhưng 'đại kỵ' với 6 nhóm người này"]}
{"scores": [0, 0, 0, 2, 0, 0, 0, 1, 0, 0], "ndcg": 0.44272256972879825, "query": "Làm thế nào để cải thiện trí nhớ", "titles": ["Bình Dương: Cải cách thủ tục hành chính không ngừng được cải thiện", "Đẩy mạnh cải cách thủ tục hành chính, cải thiện môi trường kinh doanh", "Thành phố Hồ Chí Minh tăng cường cải thiện môi trường đầu tư", "Phối hợp tập luyện trên máy thực tế ảo, 83% bệnh nhân đột quỵ não cải thiện", "Giá thuê nhà phố mặt tiền khu trung tâm giảm sâu", "Cải thiện môi trường kinh doanh, nâng cao năng lực cạnh tranh cho doanh nghiệp", "Bộ trưởng Huỳnh Thành Đạt: Việt Nam cần tiếp tục cải thiện thứ hạng trong chỉ số GII một cách bền vững", "Thiếu tá biên phòng trong vụ cháy chung cư mini đang dần hồi phục trí nhớ", "Tín hiệu cải thiện quan hệ Nhật - Hàn", "TP Hồ Chí Minh ban hành kế hoạch cải thiện, nâng cao chỉ số PCI"]}
{"scores": [1, 4, 3, 4, 3, 2, 4, 2, 4, 1], "ndcg": 0.7571507340125667, "query": "Thực phẩm nào giúp tăng sức đề kháng", "titles": ["Thực phẩm bảo vệ sức khỏe Stole Naga quảng cáo lừa dối người tiêu dùng", "Chìa khóa vàng cho sức khỏe từ Fucoidan", "Thực phẩm giúp lấy lại vóc dáng", "Top các thực phẩm nam giới tuổi nào cũng nên ăn", "Loại củ chỉ mùa đông mới có, là thần dược cho sức khỏe, giá lại rẻ bèo", "7 loại thực phẩm không nên ăn vào bữa sáng dù thèm đến mấy", "Dinh dưỡng, thực phẩm với sức khoẻ và phòng bệnh", "6 thực phẩm tự nhiên giúp gan khỏe hơn", "7 loại gia vị rẻ tiền, dễ kiếm giúp bạn khoẻ mạnh", "Kiểm nghiệm giúp đánh giá chất lượng và an toàn thực phẩm"]}
{"scores": [1, 3, 4, 0, 2, 2, 3, 3, 0, 0], "ndcg": 0.6909329431307745, "query": "Các bài tập cardio hiệu quả tại nhà", "titles": ["Lan tỏa những lợi ích tích cực từ Hội thi Sáng tạo video clip bài tập thể dục giữa giờ", "Nằm trên giường cũng có thể giảm mỡ bụng chỉ với 5 bài tập đơn giản", "Bài tập thể dục giảm mỡ bụng", "Các bài tập đi 'kinh hành', ăn chay trường, đuổi tham sân si để sống sót sau khi mắc ung thư", "4 bài tập giúp tăng chiều cao cho người trưởng thành", "Bài tập giúp cụ bà 78 tuổi, từng mắc ung thư \"cải lão hoàn đồng\"", "10 bài tập giúp cải thiện sinh lý đơn giản, hiệu quả", "Bài tập thể dục 'quốc dân' của những người sống 100 tuổi ở Nhật Bản", "Nhà phố miền Trung với nhiều khoảng 'đệm' để chống nóng", "'Xưa không có bài tập về nhà tôi vẫn giỏi, nay con học ngày học đêm vẫn lo kém'"]}
{"scores": [4, 3, 2, 4, 4, 2, 2, 1, 4, 4], "ndcg": 0.8908132653512181, "query": "Nên đầu tư vàng hay chứng khoán", "titles": ["Giá vàng và ngoại tệ 4.11: Vàng trong nước sụt giảm, riêng vàng nhẫn tăng", "Nên mua vàng miếng hay vàng nhẫn?", "Các loại vàng trên thị trường hiện nay", "Vì sao chứng khoán trồi sụt mạnh?", "Giá vàng và ngoại tệ 19.11: Vàng bật tăng nhưng nhà đầu tư vẫn thua lỗ", "Vàng non là gì?", "Vàng mỹ ký là gì?", "1 cây vàng bằng bao nhiêu chỉ?", "Giá vàng và ngoại tệ 25.10: Vàng trong nước giảm mạnh", "Các ngân hàng trung ương mua vàng kỷ lục khi giá vàng ngất ngưởng"]}
{"scores": [3, 0, 0, 0, 0, 3, 0, 0, 0, 0], "ndcg": 0.8315546295836226, "query": "Những kỹ năng cần thiết để thành công", "titles": ["Những ngành nghề không cần ngoại hình vẫn có cơ hội phát triển", "5 món đồ nội thất không cần thiết phải chi nhiều tiền, dễ gây lãng phí", "Ứng dụng công nghệ thông tin trong đại hội một cách triệt để", "Kỹ năng nghề là đơn vị tiền tệ quốc tế mới, quyết định lương của lao động", "Những đồ vật nên mang khi đi du lịch nước ngoài", "TP Hồ Chí Minh: Đẩy mạnh tư vấn hướng nghiệp, phát triển kỹ năng cho học sinh", "Chữ U ở đâu?", "Chia sẻ kỹ năng đàm phán, thương lượng và ký kết thỏa ước lao động tập thể", "Chủ tịch Hà Nội chỉ đạo tiếp tục cắt bỏ thủ tục hành chính không cần thiết", "Kỹ năng xử lý khi ô tô bị mất lái"]}
{"scores": [1, 1, 0, 0, 0, 1, 1, 1, 0, 4], "ndcg": 0.402891764700171, "query": "Chế độ ăn uống cho người tiểu đường", "titles": ["Những thứ không nên ăn uống khi 'bụng rỗng'", "Điều gì sẽ xảy ra nếu mỗi ngày bạn ăn một quả táo?", "Làm gì để dạ dày không \"nổi loạn\" khi bạn ăn giảm cân?", "Nguyên tắc ăn tối không gây béo bụng", "Bị sốt xuất huyết nên ăn gì?", "6 thực phẩm tự nhiên giúp gan khỏe hơn", "8 siêu thực phẩm lành mạnh, tốt cho sức khoẻ bạn nên ăn hàng ngày", "8 loại thịt giàu protein tốt nhất cho sức khoẻ", "Chỉ cần ngủ đúng những khung giờ này, giảm 5kg trong một tháng không hề khó", "Sữa Elisure - Nguồn dinh dưỡng lành mạnh từ các hoạt chất thiên nhiên"]}
{"scores": [4, 0, 1, 0, 0, 0, 0, 0, 0, 0], "ndcg": 0.9916236746223275, "query": "Làm sao để hết mất ngủ", "titles": ["Mỗi ngày ngủ được 3 tiếng, người phụ nữ sợ không dám ngủ cùng chồng", "Trung đạo", "Mất ngủ kéo dài, người đàn ông đột quỵ", "Lão nông vô tình đào được vật lạ, hàng đêm phát ra tiếng khóc làm cả nhà sợ hãi", "Bệnh nhân tưởng đau tim, hóa ra trầm cảm nặng", "Phương Vy: Tôi mất ngủ 1 tuần vì đêm thi đầu tiên tại Chị đẹp đạp gió rẽ sóng", "Làm sao anh ta có thể trốn thoát được?", "Làm sao để phụ nữ cân bằng kiếm tiền giỏi, dạy con ngoan?", "Phương Vy giảm 5kg, mất ngủ vì \"Chị đẹp đạp gió rẽ sóng\"", "Mã số 4972: Vợ chồng ly hôn, người đàn ông bệnh tật gồng mình nuôi con bị bệnh tim"]}
{"scores": [1, 1, 1, 0, 2, 0, 0, 2, 2, 0], "ndcg": 0.679436364798094, "query": "Những cách thư giãn sau giờ làm việc", "titles": ["Đứt nguồn tiền, người \"tự trả lương\" muốn trở lại công sở mà... tắc đường", "Điểm danh những ngành nghề dành cho người thích làm việc tại nhà", "Cách nói thay thế 'relax' và 'chill' trong tiếng Anh", "TP HCM tính thí điểm cán bộ làm việc tại nhà", "5 mẹo nhỏ giúp đốt mỡ, giảm cân hiệu quả ngay cả khi chìm vào giấc ngủ", "Chuyển trụ sở làm việc Cơ quan Liên đoàn Lao động tỉnh Bắc Giang", "Phải có cảm xúc trước vướng mắc của dân để làm việc trách nhiệm cao nhất", "Những lợi ích của việc tắm biển khiến ai cũng bất ngờ", "Đi xông hơi nhiều có tốt?", "Phía sau những chuyến xe buýt"]}
{"scores": [2, 2, 2, 4, 3, 2, 2, 0, 0, 0], "ndcg": 0.6930467933773141, "query": "Phim nào hay nhất để xem cuối tuần", "titles": ["Từ đời thực đến phim", "Phim Tết rục rịch ra rạp", "Hé lộ kết thúc của phim \"Gia đình mình vui bất thình lình\"", "Xem gì cuối tuần: Phim 18+ của Kaity Nguyễn gây chú ý", "\"Tết ở làng Địa ngục\" đứng top 1 Netflix Việt Nam nhưng gây tranh cãi", "Cách xem phim Netflix miễn phí mà không cần tài khoản", "Phim \"Gia đình mình vui bất thình lình\" đang trở về thông điệp ban đầu", "Phim Việt: Motif giống nhau, diễn viên nhẵn mặt, xem phim sau quên phim trước", "Việt Anh căng thẳng khi bắn đạn thật trong phim giờ vàng VTV", "Đổi mới cơ chế đặt hàng, tài trợ phim bằng ngân sách nhà nước"]}
