[
    {
        "query": "ăn thịt nào bổ nhất",
        "titles": [
            "Thịt chim bồ câu hay gà bổ hơn?",
            "Ăn nhiều thịt đỏ tăng nguy cơ mắc tiểu đường?",
            "Điều gì sẽ xảy ra nếu bạn chỉ ăn nhiều thịt mà không ăn cá?",
            "Tác dụng của từng loại thịt với sức khỏe",
            "Ăn thịt đỏ có làm u ung thư tiến triển nhanh?",
            "Loại rau 'bổ hơn thịt, rẻ như cho' được mệnh danh là thần dược cho sức khoẻ",
            "Chuyện kinh hoàng của người đàn bà có 100 người thân bị ‘ác thú’ hành quyết man rợ",
            "Điều gì sẽ xảy ra nếu bạn thường xuyên ăn thịt gà?",
            "Đậu phụ bổ ngang thịt gà nhưng 'đại kỵ' với 5 nhóm người này",
            "Loại quả rẻ tiền, đắng ngắt nhưng lại là 'thần dược' bổ gan, tránh ung thư",
            "Ăn nhanh hay ăn chậm tốt hơn?",
            "7 loại hạt bổ thận, tốt cho sức khoẻ nên ăn thường xuyên",
            "4 loại thịt nên ngừng hoặc hạn chế ăn nếu không muốn rước bệnh ung thư vào người",
            "Nhật sẽ bổ quả dưa được 'giải cứu' từ dải phân cách",
            "3 lý do vì sao nấm được ví 'bổ ngang thịt'",
            "Phần thịt lợn, thịt bò nào tốt nhất cho sức khỏe?",
            "Ăn thịt gà hâm lại dễ bị ung thư?",
            "Nhật bổ quả dưa hấu được 'giải cứu' từ dải phân cách",
            "Loại thịt này 'đại kỵ' với 4 nhóm người sau",
            "Thịt lươn ngon, bổ dưỡng nhưng lại 'đại kỵ' với 3 nhóm người sau",
            "Thịt gà bảo quản trong tủ lạnh được bao lâu?",
            "5 loại đồ uống bổ thận dễ làm tại nhà",
            "Thực hư ăn nhiều thịt khiến bạn đổ \"mồ hôi thịt\"",
            "Loại rau là kho chứa sắt, rẻ gấp nhiều lần thịt bò, chăm ăn không lo thiếu máu",
            "Bật mí loại rau đắt hơn thịt, bổ ngang nhân sâm"
        ],
        "scores": [
            4,
            2,
            3,
            4,
            2,
            2,
            0,
            2,
            0,
            0,
            0,
            0,
            2,
            0,
            0,
            3,
            2,
            0,
            1,
            1,
            0,
            0,
            2,
            0,
            0
        ],
        "tf-idf": 0.6171090944420985,
        "tf-idf+sbert": 0.9442156358208896,
        "bm25": 0.58971200395708,
        "bm25+phobert": 0.8514437773002509
    },
    {
        "query": "làm thế nào để giảm cân hiệu quả",
        "titles": [
            " Minh Hằng lao vào giảm cân để lấy lại vóc dáng sau hơn 1 tháng sinh con",
            "Loại gia vị quen thuộc giúp tăng hiệu quả giảm cân",
            "Thanh Hóa tiếp tục lắp đặt trạm cân, camera tại mỏ khai thác khoáng sản",
            "5 loại sữa hạt giúp cân nặng của bạn xuống nhanh mà chẳng cần tốn công sức",
            "Học ngay 'chìa khóa' giúp giảm cân của người Nhật chỉ bằng cách uống nước lọc",
            "Huấn luyện viên \"bóc mẽ\" sự thật thực phẩm chức năng giảm cân thần thánh",
            "Chỉ cần ngủ đúng những khung giờ này, giảm 5kg trong một tháng không hề khó",
            "Sao Việt giảm cân sai cách: Phương Mỹ Chi bầm dập, Lan Ngọc nhập viện",
            "Làm nhà ở xã hội cho công nhân thuê là giải pháp hiệu quả",
            "Làm gì để dạ dày không \"nổi loạn\" khi bạn ăn giảm cân?",
            "Ăn khoai lang giúp tăng hay giảm cân?",
            "6 mẹo ăn uống cực dễ áp dụng hàng ngày giúp bạn giảm cân không cần tập thể dục",
            "5 mẹo nhỏ giúp đốt mỡ, giảm cân hiệu quả ngay cả khi chìm vào giấc ngủ",
            "Nguyên tắc giúp giảm cân không cần tập luyện",
            "Uống thuốc giảm cân để dáng đẹp, cô gái 17 tuổi bị rối loạn tâm thần",
            "4 loại trà thay thế cà phê, giúp tỉnh táo mà hạ mỡ máu, ngừa ung thư hiệu quả",
            "Nắm chắc 6 mẹo ăn uống ngủ nghỉ này, việc tiêu mỡ giảm cân dễ như trở bàn tay",
            "Điều gì sẽ xảy ra nếu bạn thường xuyên bỏ bữa tối để giảm cân?",
            "TPHCM: Cứ 2 trẻ có 1 trẻ bị thừa cân, béo phì",
            "Nhập viện sau khi uống thuốc giảm cân, không ngờ nhận kết quả dương tính ma túy",
            "Duy trì được điều này đến sau tuổi 60, chị em thuộc nhóm sống thọ",
            "Món ăn sáng gây tăng cân mất kiểm soát"
        ],
        "scores": [
            3,
            5,
            0,
            5,
            5,
            3,
            5,
            2,
            0,
            3,
            3,
            5,
            5,
            5,
            4,
            0,
            5,
            4,
            0,
            3,
            0,
            3
        ],
        "tf-idf": 0.8325613960449271,
        "tf-idf+sbert": 0.968474159091532,
        "bm25": 0.8459390201595288,
        "bm25+phobert": 0.9591937919179951
    },
    {
        "query": "nhà đất giá rẻ",
        "titles": [
            "Tại sao đi du lịch Thái Lan lại rẻ?",
            "Giá điện ở Nga rẻ bất ngờ",
            "Thực phẩm giá rẻ giúp da căng mịn, trẻ trung",
            "Giá của mẫu sedan hạng C rẻ nhất Việt Nam tiếp tục \"thủng đáy\"",
            "Cấp sổ đỏ nhà đất mua bán qua giấy viết tay: TPHCM sẽ triển khai ra sao?",
            "Dùng 10 tỷ đồng để mua nhà đất hay tiếp tục ở chung cư?",
            "Sắp có MacBook giá rẻ?",
            "Nhà đất quận Hoàn Kiếm có giá từ vài trăm triệu đồng đến hơn một tỷ đồng/m2",
            "Cơn ác mộng của ôtô cỡ nhỏ giá rẻ tại Việt Nam",
            "iPhone giá rẻ sẽ có thiết kế giống iPhone 14",
            "Smartphone giá rẻ sắp được trang bị nhiều tính năng như sản phẩm cao cấp",
            "Đây là hình ảnh cho thấy lý do vì sao AirPods \"nhái\" lại có giá rẻ như vậy",
            "Có nên bán 2 căn hộ giá rẻ để mua nhà đất 3 tỷ đồng?",
            "Người Việt rủ nhau chuyển vùng để mua bộ phần mềm Adobe giá rẻ",
            "Phát hiện mới giúp Trung Quốc sản xuất chất bán dẫn giá rẻ bất ngờ",
            "Việt Nam nằm trong số các quốc gia có giá cước internet rẻ nhất thế giới",
            "Citroen e-C3 - ôtô điện châu Âu giá rẻ đấu xe Trung Quốc",
            "Toyota có thể sẽ ra mắt Land Cruiser phiên bản giá rẻ",
            "Công an TP.HCM bắt giam kẻ làm giả giấy tờ nhà đất lừa đảo 88 tỷ đồng",
            "Giá xăng Việt Nam tăng liên tục nhưng không ngờ vẫn là rẻ ở Đông Nam Á",
            "Định giá bán theo phân hạng chung cư sẽ dễ phát sinh cơ chế 'xin - cho'",
            "Có nên bán căn hộ để thuê nhà đất ?",
            "10 mẫu xe thể thao đang có giá rẻ nhất"
        ],
        "scores": [
            0,
            0,
            0,
            0,
            2,
            3,
            0,
            2,
            0,
            0,
            0,
            0,
            3,
            0,
            0,
            0,
            0,
            0,
            1,
            0,
            2,
            2,
            0
        ],
        "tf-idf": 0.9306600301428823,
        "tf-idf+sbert": 0.8514663605598318,
        "bm25": 0.9536124883715867,
        "bm25+phobert": 0.7328867016580376
    },
    {
        "query": "nên đi du lịch nước nào",
        "titles": [
            "Nên học ngành Quản trị Khách sạn - Nhà hàng trong nước hay đi du học?",
            "Hà Nội thu hút khách cao cấp bằng du lịch golf",
            "Đi du lịch Hàn Quốc cần bao nhiêu tiền?",
            "\"Du lịch cung cấp dịch vụ du khách cần, chứ không chỉ cái chúng ta có\"",
            "Tăng cường công tác quản lý điểm đến du lịch",
            "Với 5 triệu đồng nên đi du lịch ở đâu trong nước?",
            "Nên đi du lịch Trung Quốc khi nào?",
            "Nên mua Mazda2, Hyundai Accent hay Kia Sonet?",
            "Đảm bảo các hoạt động du lịch trong dịp Tết Nguyên đán Quý Mão",
            "Những địa điểm thích hợp đi du lịch một mình",
            "Nên mua Mazda2 2018 hay Attrage Premium 2021?",
            "Những mẹo vặt hay tại khách sạn khi đi du lịch",
            "Du lịch Nha Trang nên đi đâu? ",
            "Đẩy mạnh công tác truyền thông du lịch",
            "Nên đi du lịch Singapore vào tháng mấy?",
            "Ngành du lịch Thanh Hóa tìm lối đi riêng",
            "Bí quyết tránh bị ‘chặt chém’ khi đi du lịch",
            "Đi du lịch Thái Lan mùa nào đẹp?",
            "Kinh nghiệm đi du lịch Singapore tự túc",
            "Thành lập Cục Du lịch quốc gia Việt Nam",
            "Du lịch Lào Cai bứt phá mạnh mẽ",
            "Thúc đẩy hợp tác du lịch Việt Nam - Saudi Arabia",
            "Nên chọn ngành hay chọn trường trước?",
            "Nhiều ưu đãi mua xe, tận hưởng mùa du lịch từ Yamaha Motor Việt Nam",
            "Điểm danh những địa điểm du lịch Ninh Thuận không được bỏ lỡ",
            "Nên đi ngủ lúc mấy giờ để da đẹp?",
            "Nào ai hiểu Tình yêu?",
            "Khách du lịch quốc tế đến Việt Nam tăng liên tiếp",
            "Đi du lịch Thái Lan không được mang những gì?",
            "Quảng bá du lịch Việt Nam tại Campuchia",
            "Những chú ý quan trọng khi đi du lịch Trung Quốc"
        ],
        "scores": [
            1,
            3,
            4,
            2,
            1,
            4,
            4,
            0,
            1,
            3,
            0,
            2,
            3,
            1,
            4,
            1,
            2,
            4,
            3,
            1,
            3,
            2,
            0,
            0,
            3,
            0,
            0,
            2,
            1,
            1,
            3
        ],
        "tf-idf": 0.9149800525133633,
        "tf-idf+sbert": 0.8889271001001626,
        "bm25": 0.8302696686465446,
        "bm25+phobert": 0.940863369573327
    },
    {
        "query": "du học nước nào là tốt",
        "titles": [
            "Sinh viên ưu tú Trung Quốc không còn khao khát du học Mỹ",
            "Nên học ngành Quản trị Khách sạn - Nhà hàng trong nước hay đi du học?",
            "Du học phổ thông được học sinh Việt ưa thích nhất ở New Zealand",
            "Hoa hậu Ý Nhi xin lỗi, rời showbiz lên đường du học Úc sau ồn ào phát ngôn",
            "Những vấn đề trẻ thường gặp khi du học từ phổ thông",
            "Trao tặng 41 suất học bổng du học Mỹ cho học sinh tỉnh Kiên Giang\n\n​",
            "6 kênh tham khảo khi chọn trường du học Mỹ",
            "Nữ sinh điểm SAT thuộc top 1% cao nhất thế giới không chọn du học",
            "Hoa hậu Ý Nhi đăng video khóc, xin lỗi sau ồn ào phát ngôn, xác nhận đi du học ",
            "Bỏ dở hai năm đại học để du học Việt Nam",
            "Học phí với sinh viên quốc tế ở các cường quốc du học",
            "Hoa hậu Ý Nhi đi du học 2 năm, rời showbiz",
            "Du học trường top 50 về cũng chỉ chạy grab, lương tháng 15 triệu đồng?",
            "Những tiêu chí quan trọng khi chọn cơ sở giáo dục cho con du học",
            "Lừa góp vốn làm dịch vụ 'chứng minh tài chính' cho người du học",
            "Học bổng ở các thành phố du học tốt nhất thế giới",
            "Đóng góp của du học cho sự phát triển của các trường đại học trong khu vực ASEAN",
            "Tại sao nhiều bạn trẻ lại lựa chọn du học ngành ngôn ngữ Anh?",
            "Tốt và tiếc",
            "Trong ba tháng ở ẩn, Hoa hậu Ý Nhi làm gì?"
        ],
        "scores": [
            4,
            4,
            5,
            2,
            4,
            2,
            4,
            2,
            1,
            2,
            4,
            1,
            1,
            4,
            2,
            5,
            2,
            3,
            0,
            1
        ],
        "tf-idf": 0.8226909190696869,
        "tf-idf+sbert": 0.7740470335274208,
        "bm25": 0.6922796157698604,
        "bm25+phobert": 0.7635366854040557
    },
    {
        "query": "những loại thực phẩm tốt cho cơ bắp",
        "titles": [
            "Loại thịt bò nào tốt nhất cho sức khỏe?",
            "Những thực phẩm 'đại kỵ' hạt dẻ, cần ghi nhớ để tránh rước bệnh vào thân",
            "Cà phê và 5 thực phẩm tốt nhất giúp tránh xa ung thư sẵn có trong nhà bạn",
            "Kiểm nghiệm giúp đánh giá chất lượng và an toàn thực phẩm",
            "Những người nào không nên ăn gạo lứt?",
            "Những lưu ý khi sử dụng hạt sen",
            "Những người không nên ăn lạc",
            "Đến hẹn lại... lo",
            "Bạn trai cơ bắp của Hoa hậu Hòa bình vừa đăng quang tại Việt Nam",
            "700 doanh nghiệp tham gia triển lãm thực phẩm – đồ uống",
            "Top các thực phẩm nam giới tuổi nào cũng nên ăn",
            "Điều gì xảy ra nếu bạn thường xuyên ăn cá mỗi tuần?",
            "5 loại thực phẩm có hại cho não nhưng nhiều người vẫn hồn nhiên ăn",
            "Đảm bảo an toàn thực phẩm dịp Tết Trung thu năm 2022",
            "6 thực phẩm tự nhiên giúp gan khỏe hơn",
            "Loại thịt, cá giúp xây dựng cơ bắp và giảm mỡ thừa",
            "“Tìm hiểu kiến thức an toàn thực phẩm”",
            "8 loại thực phẩm tuyệt đối không ăn vào buổi tối",
            "Thực phẩm giúp lấy lại vóc dáng",
            "Loại thực phẩm không nên ăn nếu muốn kéo dài tuổi thọ",
            "Bắt nhiều vụ buôn bán thực phẩm không rõ nguồn gốc, xuất xứ",
            "7 loại thực phẩm không nên ăn vào bữa sáng dù thèm đến mấy",
            "Những món ăn sáng giúp phụ nữ vừa khỏe vừa đẹp",
            "Phụ nữ cả nước chung tay đảm bảo an toàn thực phẩm",
            "Đẩy mạnh phát triển hệ thống kinh doanh thực phẩm an toàn",
            "Nâng cao nhận thức về tầm quan trọng của an toàn thực phẩm",
            "5 loại thực phẩm nên tránh ăn vào buổi tối kẻo rước hoạ vào thân"
        ],
        "scores": [
            5,
            2,
            1,
            0,
            1,
            1,
            1,
            1,
            0,
            1,
            2,
            2,
            1,
            0,
            1,
            5,
            2,
            1,
            3,
            1,
            1,
            1,
            3,
            1,
            0,
            0,
            1
        ],
        "tf-idf": 0.8713893367117675,
        "tf-idf+sbert": 0.986381341597845,
        "bm25": 0.961691542039224,
        "bm25+phobert": 0.845267204584517
    },
    {
        "query": "cách chống trầm cảm ",
        "titles": [
            "Những vấn đề trẻ thường gặp khi du học từ phổ thông",
            "Áp lực trong kỳ thi đại học ở Hàn Quốc",
            "Hôn nhân bế tắc, người đàn ông lao vào uống rượu đến trầm cảm nặng",
            "Nhạc sĩ Quốc Bảo: Từng muốn tự tử vì trầm cảm, cho đi hết các bộ sưu tập",
            "Tăng cường công tác phòng, chống tội phạm Việt Nam - Vương quốc Anh",
            "Khánh Ngọc \"Vầng trăng khóc\": Từng suy sụp vì mất giọng, trầm cảm sau sinh",
            "Diệp Lâm Anh mắc bệnh trầm cảm cười, Lưu Hương Giang từng bị bạo lực học đường",
            "Bùi Lan Hương lần đầu hé lộ bị trầm cảm, đang \"cố gắng chiến đấu từng ngày\"",
            "Diệp Lâm Anh khóc nức nở kể về bệnh trầm cảm cười ở show Chị đẹp",
            "Bắc Giang chú trọng chống chuyển giá với doanh nghiệp FDI",
            "MC điển trai Hạo Đình tự tử ở tuổi 35",
            "Cách mở tài khoản không cần đến ngân hàng",
            "Người 'giải mã' bộ não cứu bệnh nhân trầm cảm",
            "Cách chống thấm tường giáp ranh khi có khoảng hở",
            "Lan Phương từng trầm cảm sau sinh: 'Cảm thấy mình vô dụng, dễ bị kích động'",
            "Bị trầm cảm không dám đi khám vì sợ mang tiếng \"làm trò\"",
            "Chạy bộ điều trị bệnh trầm cảm tốt như thế nào?",
            "Bạn gái đạo diễn Nguyễn Quang Dũng tiết lộ bị trầm cảm, nghỉ hát 1 năm",
            "Siu Black: ‘Tôi trầm cảm nặng, 10 ngày không ăn uống, tưởng sẽ không qua khỏi’",
            "Hay làm việc xuyên đêm, người phụ nữ phải đi khám tâm thần",
            "Những thước phim cuối cùng của Sulli trước khi tự tử vì trầm cảm",
            "13% học sinh có xu hướng bị trầm cảm vì COVID-19",
            "Giáo viên 'trầm cảm' với những bài làm sáng tạo của học trò",
            "Cách đơn giản chống đọng nước gương hậu ôtô"
        ],
        "scores": [
            3,
            2,
            2,
            2,
            0,
            2,
            2,
            2,
            2,
            0,
            1,
            0,
            4,
            0,
            2,
            1,
            5,
            1,
            1,
            3,
            1,
            3,
            1,
            0
        ],
        "tf-idf": 0.6139812065443807,
        "tf-idf+sbert": 0.6966483524618443,
        "bm25": 0.6075269760862535,
        "bm25+phobert": 0.6868385261641042
    }
]